newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.h
/*
 * Copyright (c) 2013 - 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2107 NXP
 * All rights reserved.
 *
 * THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */

#if !defined(CLOCK_MPC57XX_H)
#define CLOCK_MPC57XX_H

/*!
 * @file clock_MPC57XX.h
 */

#include "status.h"
#include <stdint.h>
#include <stdbool.h>
#include "MPC5676R.h"
#include "MPC5676R_features.h"

/*! @file clock_MPC5748G.h */

/*!
 * @file clock_MPC57xx.h
 *
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, Global macro not referenced.
 * This is required to implement enumeration entries as macro.
 * Enumeration entries (macros) are referenced from application code.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, Global typedef not referenced.
 * The specified typedefs might be used in the user code for composing masks
 * which could be passed to some of the clock_manager driver functions.
 *
 */

/*!
 * @ingroup clock_manager
 * @defgroup clock_MPC57xx
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* @brief Key and inverted key values so write access to MCTL register is permitted */
#define FEATURE_MC_ME_KEY           (0x5AF0U)
#define FEATURE_MC_ME_KEY_INV       (0xA50FU)

/* @brief Maximum number of the CMUs that can be configured */
#define CMU_MAX_NO 9u

/* @brief EXTAL0 clock frequency. */
extern uint32_t g_xtal0ClkFreq;

/* @brief EXTAL1 clock frequency. */
extern uint32_t g_xtal1ClkFreq;

/* @brief SIPI_REF clock frequency. */
extern uint32_t g_sipiRefClkFreq;

/*!
 * @brief SIU clock divider
 * Implements siu_clk_div_t_Class
 */
typedef enum {

	SIU_CLOCK_DIV_BY_1 = 0U, /*!< Divided by 1                 */
	SIU_CLOCK_DIV_BY_2 = 1U, /*!< Divided by 2                 */
	SIU_CLOCK_DIV_BY_3 = 2U, /*!< Divided by 3                 */
	SIU_CLOCK_DIV_BY_4 = 3U, /*!< Divided by 4                 */
	SIU_CLOCK_DIV_BY_5 = 4U, /*!< Divided by 5                 */
	SIU_CLOCK_DIV_BY_6 = 5U, /*!< Divided by 6                 */
	SIU_CLOCK_DIV_BY_7 = 6U, /*!< Divided by 7                 */
	SIU_CLOCK_DIV_BY_8 = 7U, /*!< Divided by 8                 */
	SIU_CLOCK_DIV_BY_9 = 8U, /*!< Divided by 9                 */
	SIU_CLOCK_DIV_BY_10 = 9U, /*!< Divided by 10                */
	SIU_CLOCK_DIV_BY_11 = 10U, /*!< Divided by 11                */
	SIU_CLOCK_DIV_BY_12 = 11U, /*!< Divided by 12                */
	SIU_CLOCK_DIV_BY_13 = 12U, /*!< Divided by 13                */
	SIU_CLOCK_DIV_BY_14 = 13U, /*!< Divided by 14                */
	SIU_CLOCK_DIV_BY_15 = 14U, /*!< Divided by 15                */
	SIU_CLOCK_DIV_BY_16 = 15U, /*!< Divided by 16                */
	SIU_CLOCK_DIV_BY_17 = 16U, /*!< Divided by 17                */
	SIU_CLOCK_DIV_BY_18 = 17U, /*!< Divided by 18                */
	SIU_CLOCK_DIV_BY_19 = 18U, /*!< Divided by 19                */
	SIU_CLOCK_DIV_BY_20 = 19U, /*!< Divided by 20                */
	SIU_CLOCK_DIV_BY_21 = 20U, /*!< Divided by 21                */
	SIU_CLOCK_DIV_BY_22 = 21U, /*!< Divided by 22                */
	SIU_CLOCK_DIV_BY_23 = 22U, /*!< Divided by 23                */
	SIU_CLOCK_DIV_BY_24 = 23U, /*!< Divided by 24                */
	SIU_CLOCK_DIV_BY_25 = 24U, /*!< Divided by 25                */
	SIU_CLOCK_DIV_BY_26 = 25U, /*!< Divided by 26                */
	SIU_CLOCK_DIV_BY_27 = 26U, /*!< Divided by 27                */
	SIU_CLOCK_DIV_BY_28 = 27U, /*!< Divided by 28                */
	SIU_CLOCK_DIV_BY_29 = 28U, /*!< Divided by 29                */
	SIU_CLOCK_DIV_BY_30 = 29U, /*!< Divided by 30                */
	SIU_CLOCK_DIV_BY_31 = 30U, /*!< Divided by 31                */
	SIU_CLOCK_DIV_BY_32 = 31U, /*!< Divided by 32                */
	SIU_CLOCK_DIV_BY_33 = 32U, /*!< Divided by 33                */
	SIU_CLOCK_DIV_BY_34 = 33U, /*!< Divided by 34                */
	SIU_CLOCK_DIV_BY_35 = 34U, /*!< Divided by 35                */
	SIU_CLOCK_DIV_BY_36 = 35U, /*!< Divided by 36                */
	SIU_CLOCK_DIV_BY_37 = 36U, /*!< Divided by 37                */
	SIU_CLOCK_DIV_BY_38 = 37U, /*!< Divided by 38                */
	SIU_CLOCK_DIV_BY_39 = 38U, /*!< Divided by 39                */
	SIU_CLOCK_DIV_BY_40 = 39U, /*!< Divided by 40                */
	SIU_CLOCK_DIV_BY_41 = 40U, /*!< Divided by 41                */
	SIU_CLOCK_DIV_BY_42 = 41U, /*!< Divided by 42                */
	SIU_CLOCK_DIV_BY_43 = 42U, /*!< Divided by 43                */
	SIU_CLOCK_DIV_BY_44 = 43U, /*!< Divided by 44                */
	SIU_CLOCK_DIV_BY_45 = 44U, /*!< Divided by 45                */
	SIU_CLOCK_DIV_BY_46 = 45U, /*!< Divided by 46                */
	SIU_CLOCK_DIV_BY_47 = 46U, /*!< Divided by 47                */
	SIU_CLOCK_DIV_BY_48 = 47U, /*!< Divided by 48                */
	SIU_CLOCK_DIV_BY_49 = 48U, /*!< Divided by 49                */
	SIU_CLOCK_DIV_BY_50 = 49U, /*!< Divided by 50                */
	SIU_CLOCK_DIV_BY_51 = 50U, /*!< Divided by 51                */
	SIU_CLOCK_DIV_BY_52 = 51U, /*!< Divided by 52                */
	SIU_CLOCK_DIV_BY_53 = 52U, /*!< Divided by 53                */
	SIU_CLOCK_DIV_BY_54 = 53U, /*!< Divided by 54                */
	SIU_CLOCK_DIV_BY_55 = 54U, /*!< Divided by 55                */
	SIU_CLOCK_DIV_BY_56 = 55U, /*!< Divided by 56                */
	SIU_CLOCK_DIV_BY_57 = 56U, /*!< Divided by 57                */
	SIU_CLOCK_DIV_BY_58 = 57U, /*!< Divided by 58                */
	SIU_CLOCK_DIV_BY_59 = 58U, /*!< Divided by 59                */
	SIU_CLOCK_DIV_BY_60 = 59U, /*!< Divided by 60                */
	SIU_CLOCK_DIV_BY_61 = 60U, /*!< Divided by 61                */
	SIU_CLOCK_DIV_BY_62 = 61U, /*!< Divided by 62                */
	SIU_CLOCK_DIV_BY_63 = 62U, /*!< Divided by 63                */
	SIU_CLOCK_DIV_BY_64 = 63U, /*!< Divided by 64                */
	SIU_CLOCK_DIV_BY_65 = 64U, /*!< Divided by 65                */
	SIU_CLOCK_DIV_BY_66 = 65U, /*!< Divided by 66                */
	SIU_CLOCK_DIV_BY_67 = 66U, /*!< Divided by 67                */
	SIU_CLOCK_DIV_BY_68 = 67U, /*!< Divided by 68                */
	SIU_CLOCK_DIV_BY_69 = 68U, /*!< Divided by 69                */
	SIU_CLOCK_DIV_BY_70 = 69U, /*!< Divided by 70                */
	SIU_CLOCK_DIV_BY_71 = 70U, /*!< Divided by 71                */
	SIU_CLOCK_DIV_BY_72 = 71U, /*!< Divided by 72                */
	SIU_CLOCK_DIV_BY_73 = 72U, /*!< Divided by 73                */
	SIU_CLOCK_DIV_BY_74 = 73U, /*!< Divided by 74                */
	SIU_CLOCK_DIV_BY_75 = 74U, /*!< Divided by 75                */
	SIU_CLOCK_DIV_BY_76 = 75U, /*!< Divided by 76                */
	SIU_CLOCK_DIV_BY_77 = 76U, /*!< Divided by 77                */
	SIU_CLOCK_DIV_BY_78 = 77U, /*!< Divided by 78                */
	SIU_CLOCK_DIV_BY_79 = 78U, /*!< Divided by 79                */
	SIU_CLOCK_DIV_BY_80 = 79U, /*!< Divided by 80                */
	SIU_CLOCK_DIV_BY_81 = 80U, /*!< Divided by 81                */
	SIU_CLOCK_DIV_BY_82 = 81U, /*!< Divided by 82                */
	SIU_CLOCK_DIV_BY_83 = 82U, /*!< Divided by 83                */
	SIU_CLOCK_DIV_BY_84 = 83U, /*!< Divided by 84                */
	SIU_CLOCK_DIV_BY_85 = 84U, /*!< Divided by 85                */
	SIU_CLOCK_DIV_BY_86 = 85U, /*!< Divided by 86                */
	SIU_CLOCK_DIV_BY_87 = 86U, /*!< Divided by 87                */
	SIU_CLOCK_DIV_BY_88 = 87U, /*!< Divided by 88                */
	SIU_CLOCK_DIV_BY_89 = 88U, /*!< Divided by 89                */
	SIU_CLOCK_DIV_BY_90 = 89U, /*!< Divided by 90                */
	SIU_CLOCK_DIV_BY_91 = 90U, /*!< Divided by 91                */
	SIU_CLOCK_DIV_BY_92 = 91U, /*!< Divided by 92                */
	SIU_CLOCK_DIV_BY_93 = 92U, /*!< Divided by 93                */
	SIU_CLOCK_DIV_BY_94 = 93U, /*!< Divided by 94                */
	SIU_CLOCK_DIV_BY_95 = 94U, /*!< Divided by 95                */
	SIU_CLOCK_DIV_BY_96 = 95U, /*!< Divided by 96                */
	SIU_CLOCK_DIV_BY_97 = 96U, /*!< Divided by 97                */
	SIU_CLOCK_DIV_BY_98 = 97U, /*!< Divided by 98                */
	SIU_CLOCK_DIV_BY_99 = 98U, /*!< Divided by 99                */
	SIU_CLOCK_DIV_BY_100 = 99U, /*!< Divided by 100               */
	SIU_CLOCK_DIV_BY_101 = 100U, /*!< Divided by 101               */
	SIU_CLOCK_DIV_BY_102 = 101U, /*!< Divided by 102               */
	SIU_CLOCK_DIV_BY_103 = 102U, /*!< Divided by 103               */
	SIU_CLOCK_DIV_BY_104 = 103U, /*!< Divided by 104               */
	SIU_CLOCK_DIV_BY_105 = 104U, /*!< Divided by 105               */
	SIU_CLOCK_DIV_BY_106 = 105U, /*!< Divided by 106               */
	SIU_CLOCK_DIV_BY_107 = 106U, /*!< Divided by 107               */
	SIU_CLOCK_DIV_BY_108 = 107U, /*!< Divided by 108               */
	SIU_CLOCK_DIV_BY_109 = 108U, /*!< Divided by 109               */
	SIU_CLOCK_DIV_BY_110 = 109U, /*!< Divided by 110               */
	SIU_CLOCK_DIV_BY_111 = 110U, /*!< Divided by 111               */
	SIU_CLOCK_DIV_BY_112 = 111U, /*!< Divided by 112               */
	SIU_CLOCK_DIV_BY_113 = 112U, /*!< Divided by 113               */
	SIU_CLOCK_DIV_BY_114 = 113U, /*!< Divided by 114               */
	SIU_CLOCK_DIV_BY_115 = 114U, /*!< Divided by 115               */
	SIU_CLOCK_DIV_BY_116 = 115U, /*!< Divided by 116               */
	SIU_CLOCK_DIV_BY_117 = 116U, /*!< Divided by 117               */
	SIU_CLOCK_DIV_BY_118 = 117U, /*!< Divided by 118               */
	SIU_CLOCK_DIV_BY_119 = 118U, /*!< Divided by 119               */
	SIU_CLOCK_DIV_BY_120 = 119U, /*!< Divided by 120               */
	SIU_CLOCK_DIV_BY_121 = 120U, /*!< Divided by 121               */
	SIU_CLOCK_DIV_BY_122 = 121U, /*!< Divided by 122               */
	SIU_CLOCK_DIV_BY_123 = 122U, /*!< Divided by 123               */
	SIU_CLOCK_DIV_BY_124 = 123U, /*!< Divided by 124               */
	SIU_CLOCK_DIV_BY_125 = 124U, /*!< Divided by 125               */
	SIU_CLOCK_DIV_BY_126 = 125U, /*!< Divided by 126               */
	SIU_CLOCK_DIV_BY_127 = 126U, /*!< Divided by 127               */
	SIU_CLOCK_DIV_BY_128 = 127U, /*!< Divided by 128               */
	SIU_CLOCK_DIV_BY_129 = 128U, /*!< Divided by 129               */
	SIU_CLOCK_DIV_BY_130 = 129U, /*!< Divided by 130               */
	SIU_CLOCK_DIV_BY_131 = 130U, /*!< Divided by 131               */
	SIU_CLOCK_DIV_BY_132 = 131U, /*!< Divided by 132               */
	SIU_CLOCK_DIV_BY_133 = 132U, /*!< Divided by 133               */
	SIU_CLOCK_DIV_BY_134 = 133U, /*!< Divided by 134               */
	SIU_CLOCK_DIV_BY_135 = 134U, /*!< Divided by 135               */
	SIU_CLOCK_DIV_BY_136 = 135U, /*!< Divided by 136               */
	SIU_CLOCK_DIV_BY_137 = 136U, /*!< Divided by 137               */
	SIU_CLOCK_DIV_BY_138 = 137U, /*!< Divided by 138               */
	SIU_CLOCK_DIV_BY_139 = 138U, /*!< Divided by 139               */
	SIU_CLOCK_DIV_BY_140 = 139U, /*!< Divided by 140               */
	SIU_CLOCK_DIV_BY_141 = 140U, /*!< Divided by 141               */
	SIU_CLOCK_DIV_BY_142 = 141U, /*!< Divided by 142               */
	SIU_CLOCK_DIV_BY_143 = 142U, /*!< Divided by 143               */
	SIU_CLOCK_DIV_BY_144 = 143U, /*!< Divided by 144               */
	SIU_CLOCK_DIV_BY_145 = 144U, /*!< Divided by 145               */
	SIU_CLOCK_DIV_BY_146 = 145U, /*!< Divided by 146               */
	SIU_CLOCK_DIV_BY_147 = 146U, /*!< Divided by 147               */
	SIU_CLOCK_DIV_BY_148 = 147U, /*!< Divided by 148               */
	SIU_CLOCK_DIV_BY_149 = 148U, /*!< Divided by 149               */
	SIU_CLOCK_DIV_BY_150 = 149U, /*!< Divided by 150               */
	SIU_CLOCK_DIV_BY_151 = 150U, /*!< Divided by 151               */
	SIU_CLOCK_DIV_BY_152 = 151U, /*!< Divided by 152               */
	SIU_CLOCK_DIV_BY_153 = 152U, /*!< Divided by 153               */
	SIU_CLOCK_DIV_BY_154 = 153U, /*!< Divided by 154               */
	SIU_CLOCK_DIV_BY_155 = 154U, /*!< Divided by 155               */
	SIU_CLOCK_DIV_BY_156 = 155U, /*!< Divided by 156               */
	SIU_CLOCK_DIV_BY_157 = 156U, /*!< Divided by 157               */
	SIU_CLOCK_DIV_BY_158 = 157U, /*!< Divided by 158               */
	SIU_CLOCK_DIV_BY_159 = 158U, /*!< Divided by 159               */
	SIU_CLOCK_DIV_BY_160 = 159U, /*!< Divided by 160               */
	SIU_CLOCK_DIV_BY_161 = 160U, /*!< Divided by 161               */
	SIU_CLOCK_DIV_BY_162 = 161U, /*!< Divided by 162               */
	SIU_CLOCK_DIV_BY_163 = 162U, /*!< Divided by 163               */
	SIU_CLOCK_DIV_BY_164 = 163U, /*!< Divided by 164               */
	SIU_CLOCK_DIV_BY_165 = 164U, /*!< Divided by 165               */
	SIU_CLOCK_DIV_BY_166 = 165U, /*!< Divided by 166               */
	SIU_CLOCK_DIV_BY_167 = 166U, /*!< Divided by 167               */
	SIU_CLOCK_DIV_BY_168 = 167U, /*!< Divided by 168               */
	SIU_CLOCK_DIV_BY_169 = 168U, /*!< Divided by 169               */
	SIU_CLOCK_DIV_BY_170 = 169U, /*!< Divided by 170               */
	SIU_CLOCK_DIV_BY_171 = 170U, /*!< Divided by 171               */
	SIU_CLOCK_DIV_BY_172 = 171U, /*!< Divided by 172               */
	SIU_CLOCK_DIV_BY_173 = 172U, /*!< Divided by 173               */
	SIU_CLOCK_DIV_BY_174 = 173U, /*!< Divided by 174               */
	SIU_CLOCK_DIV_BY_175 = 174U, /*!< Divided by 175               */
	SIU_CLOCK_DIV_BY_176 = 175U, /*!< Divided by 176               */
	SIU_CLOCK_DIV_BY_177 = 176U, /*!< Divided by 177               */
	SIU_CLOCK_DIV_BY_178 = 177U, /*!< Divided by 178               */
	SIU_CLOCK_DIV_BY_179 = 178U, /*!< Divided by 179               */
	SIU_CLOCK_DIV_BY_180 = 179U, /*!< Divided by 180               */
	SIU_CLOCK_DIV_BY_181 = 180U, /*!< Divided by 181               */
	SIU_CLOCK_DIV_BY_182 = 181U, /*!< Divided by 182               */
	SIU_CLOCK_DIV_BY_183 = 182U, /*!< Divided by 183               */
	SIU_CLOCK_DIV_BY_184 = 183U, /*!< Divided by 184               */
	SIU_CLOCK_DIV_BY_185 = 184U, /*!< Divided by 185               */
	SIU_CLOCK_DIV_BY_186 = 185U, /*!< Divided by 186               */
	SIU_CLOCK_DIV_BY_187 = 186U, /*!< Divided by 187               */
	SIU_CLOCK_DIV_BY_188 = 187U, /*!< Divided by 188               */
	SIU_CLOCK_DIV_BY_189 = 188U, /*!< Divided by 189               */
	SIU_CLOCK_DIV_BY_190 = 189U, /*!< Divided by 190               */
	SIU_CLOCK_DIV_BY_191 = 190U, /*!< Divided by 191               */
	SIU_CLOCK_DIV_BY_192 = 191U, /*!< Divided by 192               */
	SIU_CLOCK_DIV_BY_193 = 192U, /*!< Divided by 193               */
	SIU_CLOCK_DIV_BY_194 = 193U, /*!< Divided by 194               */
	SIU_CLOCK_DIV_BY_195 = 194U, /*!< Divided by 195               */
	SIU_CLOCK_DIV_BY_196 = 195U, /*!< Divided by 196               */
	SIU_CLOCK_DIV_BY_197 = 196U, /*!< Divided by 197               */
	SIU_CLOCK_DIV_BY_198 = 197U, /*!< Divided by 198               */
	SIU_CLOCK_DIV_BY_199 = 198U, /*!< Divided by 199               */
	SIU_CLOCK_DIV_BY_200 = 199U, /*!< Divided by 200               */
	SIU_CLOCK_DIV_BY_201 = 200U, /*!< Divided by 201               */
	SIU_CLOCK_DIV_BY_202 = 201U, /*!< Divided by 202               */
	SIU_CLOCK_DIV_BY_203 = 202U, /*!< Divided by 203               */
	SIU_CLOCK_DIV_BY_204 = 203U, /*!< Divided by 204               */
	SIU_CLOCK_DIV_BY_205 = 204U, /*!< Divided by 205               */
	SIU_CLOCK_DIV_BY_206 = 205U, /*!< Divided by 206               */
	SIU_CLOCK_DIV_BY_207 = 206U, /*!< Divided by 207               */
	SIU_CLOCK_DIV_BY_208 = 207U, /*!< Divided by 208               */
	SIU_CLOCK_DIV_BY_209 = 208U, /*!< Divided by 209               */
	SIU_CLOCK_DIV_BY_210 = 209U, /*!< Divided by 210               */
	SIU_CLOCK_DIV_BY_211 = 210U, /*!< Divided by 211               */
	SIU_CLOCK_DIV_BY_212 = 211U, /*!< Divided by 212               */
	SIU_CLOCK_DIV_BY_213 = 212U, /*!< Divided by 213               */
	SIU_CLOCK_DIV_BY_214 = 213U, /*!< Divided by 214               */
	SIU_CLOCK_DIV_BY_215 = 214U, /*!< Divided by 215               */
	SIU_CLOCK_DIV_BY_216 = 215U, /*!< Divided by 216               */
	SIU_CLOCK_DIV_BY_217 = 216U, /*!< Divided by 217               */
	SIU_CLOCK_DIV_BY_218 = 217U, /*!< Divided by 218               */
	SIU_CLOCK_DIV_BY_219 = 218U, /*!< Divided by 219               */
	SIU_CLOCK_DIV_BY_220 = 219U, /*!< Divided by 220               */
	SIU_CLOCK_DIV_BY_221 = 220U, /*!< Divided by 221               */
	SIU_CLOCK_DIV_BY_222 = 221U, /*!< Divided by 222               */
	SIU_CLOCK_DIV_BY_223 = 222U, /*!< Divided by 223               */
	SIU_CLOCK_DIV_BY_224 = 223U, /*!< Divided by 224               */
	SIU_CLOCK_DIV_BY_225 = 224U, /*!< Divided by 225               */
	SIU_CLOCK_DIV_BY_226 = 225U, /*!< Divided by 226               */
	SIU_CLOCK_DIV_BY_227 = 226U, /*!< Divided by 227               */
	SIU_CLOCK_DIV_BY_228 = 227U, /*!< Divided by 228               */
	SIU_CLOCK_DIV_BY_229 = 228U, /*!< Divided by 229               */
	SIU_CLOCK_DIV_BY_230 = 229U, /*!< Divided by 230               */
	SIU_CLOCK_DIV_BY_231 = 230U, /*!< Divided by 231               */
	SIU_CLOCK_DIV_BY_232 = 231U, /*!< Divided by 232               */
	SIU_CLOCK_DIV_BY_233 = 232U, /*!< Divided by 233               */
	SIU_CLOCK_DIV_BY_234 = 233U, /*!< Divided by 234               */
	SIU_CLOCK_DIV_BY_235 = 234U, /*!< Divided by 235               */
	SIU_CLOCK_DIV_BY_236 = 235U, /*!< Divided by 236               */
	SIU_CLOCK_DIV_BY_237 = 236U, /*!< Divided by 237               */
	SIU_CLOCK_DIV_BY_238 = 237U, /*!< Divided by 238               */
	SIU_CLOCK_DIV_BY_239 = 238U, /*!< Divided by 239               */
	SIU_CLOCK_DIV_BY_240 = 239U, /*!< Divided by 240               */
	SIU_CLOCK_DIV_BY_241 = 240U, /*!< Divided by 241               */
	SIU_CLOCK_DIV_BY_242 = 241U, /*!< Divided by 242               */
	SIU_CLOCK_DIV_BY_243 = 242U, /*!< Divided by 243               */
	SIU_CLOCK_DIV_BY_244 = 243U, /*!< Divided by 244               */
	SIU_CLOCK_DIV_BY_245 = 244U, /*!< Divided by 245               */
	SIU_CLOCK_DIV_BY_246 = 245U, /*!< Divided by 246               */
	SIU_CLOCK_DIV_BY_247 = 246U, /*!< Divided by 247               */
	SIU_CLOCK_DIV_BY_248 = 247U, /*!< Divided by 248               */
	SIU_CLOCK_DIV_BY_249 = 248U, /*!< Divided by 249               */
	SIU_CLOCK_DIV_BY_250 = 249U, /*!< Divided by 250               */
	SIU_CLOCK_DIV_BY_251 = 250U, /*!< Divided by 251               */
	SIU_CLOCK_DIV_BY_252 = 251U, /*!< Divided by 252               */
	SIU_CLOCK_DIV_BY_253 = 252U, /*!< Divided by 253               */
	SIU_CLOCK_DIV_BY_254 = 253U, /*!< Divided by 254               */
	SIU_CLOCK_DIV_BY_255 = 254U, /*!< Divided by 255               */
	SIU_CLOCK_DIV_BY_256 = 255U, /*!< Divided by 256               */
	SIU_CLOCK_DIV_BY_257 = 256U, /*!< Divided by 257               */
	SIU_CLOCK_DIV_BY_258 = 257U, /*!< Divided by 258               */
	SIU_CLOCK_DIV_BY_259 = 258U, /*!< Divided by 259               */
	SIU_CLOCK_DIV_BY_260 = 259U, /*!< Divided by 260               */
	SIU_CLOCK_DIV_BY_261 = 260U, /*!< Divided by 261               */
	SIU_CLOCK_DIV_BY_262 = 261U, /*!< Divided by 262               */
	SIU_CLOCK_DIV_BY_263 = 262U, /*!< Divided by 263               */
	SIU_CLOCK_DIV_BY_264 = 263U, /*!< Divided by 264               */
	SIU_CLOCK_DIV_BY_265 = 264U, /*!< Divided by 265               */
	SIU_CLOCK_DIV_BY_266 = 265U, /*!< Divided by 266               */
	SIU_CLOCK_DIV_BY_267 = 266U, /*!< Divided by 267               */
	SIU_CLOCK_DIV_BY_268 = 267U, /*!< Divided by 268               */
	SIU_CLOCK_DIV_BY_269 = 268U, /*!< Divided by 269               */
	SIU_CLOCK_DIV_BY_270 = 269U, /*!< Divided by 270               */
	SIU_CLOCK_DIV_BY_271 = 270U, /*!< Divided by 271               */
	SIU_CLOCK_DIV_BY_272 = 271U, /*!< Divided by 272               */
	SIU_CLOCK_DIV_BY_273 = 272U, /*!< Divided by 273               */
	SIU_CLOCK_DIV_BY_274 = 273U, /*!< Divided by 274               */
	SIU_CLOCK_DIV_BY_275 = 274U, /*!< Divided by 275               */
	SIU_CLOCK_DIV_BY_276 = 275U, /*!< Divided by 276               */
	SIU_CLOCK_DIV_BY_277 = 276U, /*!< Divided by 277               */
	SIU_CLOCK_DIV_BY_278 = 277U, /*!< Divided by 278               */
	SIU_CLOCK_DIV_BY_279 = 278U, /*!< Divided by 279               */
	SIU_CLOCK_DIV_BY_280 = 279U, /*!< Divided by 280               */
	SIU_CLOCK_DIV_BY_281 = 280U, /*!< Divided by 281               */
	SIU_CLOCK_DIV_BY_282 = 281U, /*!< Divided by 282               */
	SIU_CLOCK_DIV_BY_283 = 282U, /*!< Divided by 283               */
	SIU_CLOCK_DIV_BY_284 = 283U, /*!< Divided by 284               */
	SIU_CLOCK_DIV_BY_285 = 284U, /*!< Divided by 285               */
	SIU_CLOCK_DIV_BY_286 = 285U, /*!< Divided by 286               */
	SIU_CLOCK_DIV_BY_287 = 286U, /*!< Divided by 287               */
	SIU_CLOCK_DIV_BY_288 = 287U, /*!< Divided by 288               */
	SIU_CLOCK_DIV_BY_289 = 288U, /*!< Divided by 289               */
	SIU_CLOCK_DIV_BY_290 = 289U, /*!< Divided by 290               */
	SIU_CLOCK_DIV_BY_291 = 290U, /*!< Divided by 291               */
	SIU_CLOCK_DIV_BY_292 = 291U, /*!< Divided by 292               */
	SIU_CLOCK_DIV_BY_293 = 292U, /*!< Divided by 293               */
	SIU_CLOCK_DIV_BY_294 = 293U, /*!< Divided by 294               */
	SIU_CLOCK_DIV_BY_295 = 294U, /*!< Divided by 295               */
	SIU_CLOCK_DIV_BY_296 = 295U, /*!< Divided by 296               */
	SIU_CLOCK_DIV_BY_297 = 296U, /*!< Divided by 297               */
	SIU_CLOCK_DIV_BY_298 = 297U, /*!< Divided by 298               */
	SIU_CLOCK_DIV_BY_299 = 298U, /*!< Divided by 299               */
	SIU_CLOCK_DIV_BY_300 = 299U, /*!< Divided by 300               */
	SIU_CLOCK_DIV_BY_301 = 300U, /*!< Divided by 301               */
	SIU_CLOCK_DIV_BY_302 = 301U, /*!< Divided by 302               */
	SIU_CLOCK_DIV_BY_303 = 302U, /*!< Divided by 303               */
	SIU_CLOCK_DIV_BY_304 = 303U, /*!< Divided by 304               */
	SIU_CLOCK_DIV_BY_305 = 304U, /*!< Divided by 305               */
	SIU_CLOCK_DIV_BY_306 = 305U, /*!< Divided by 306               */
	SIU_CLOCK_DIV_BY_307 = 306U, /*!< Divided by 307               */
	SIU_CLOCK_DIV_BY_308 = 307U, /*!< Divided by 308               */
	SIU_CLOCK_DIV_BY_309 = 308U, /*!< Divided by 309               */
	SIU_CLOCK_DIV_BY_310 = 309U, /*!< Divided by 310               */
	SIU_CLOCK_DIV_BY_311 = 310U, /*!< Divided by 311               */
	SIU_CLOCK_DIV_BY_312 = 311U, /*!< Divided by 312               */
	SIU_CLOCK_DIV_BY_313 = 312U, /*!< Divided by 313               */
	SIU_CLOCK_DIV_BY_314 = 313U, /*!< Divided by 314               */
	SIU_CLOCK_DIV_BY_315 = 314U, /*!< Divided by 315               */
	SIU_CLOCK_DIV_BY_316 = 315U, /*!< Divided by 316               */
	SIU_CLOCK_DIV_BY_317 = 316U, /*!< Divided by 317               */
	SIU_CLOCK_DIV_BY_318 = 317U, /*!< Divided by 318               */
	SIU_CLOCK_DIV_BY_319 = 318U, /*!< Divided by 319               */
	SIU_CLOCK_DIV_BY_320 = 319U, /*!< Divided by 320               */
	SIU_CLOCK_DIV_BY_321 = 320U, /*!< Divided by 321               */
	SIU_CLOCK_DIV_BY_322 = 321U, /*!< Divided by 322               */
	SIU_CLOCK_DIV_BY_323 = 322U, /*!< Divided by 323               */
	SIU_CLOCK_DIV_BY_324 = 323U, /*!< Divided by 324               */
