newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.h
	SIU_CLOCK_DIV_BY_325 = 324U, /*!< Divided by 325               */
	SIU_CLOCK_DIV_BY_326 = 325U, /*!< Divided by 326               */
	SIU_CLOCK_DIV_BY_327 = 326U, /*!< Divided by 327               */
	SIU_CLOCK_DIV_BY_328 = 327U, /*!< Divided by 328               */
	SIU_CLOCK_DIV_BY_329 = 328U, /*!< Divided by 329               */
	SIU_CLOCK_DIV_BY_330 = 329U, /*!< Divided by 330               */
	SIU_CLOCK_DIV_BY_331 = 330U, /*!< Divided by 331               */
	SIU_CLOCK_DIV_BY_332 = 331U, /*!< Divided by 332               */
	SIU_CLOCK_DIV_BY_333 = 332U, /*!< Divided by 333               */
	SIU_CLOCK_DIV_BY_334 = 333U, /*!< Divided by 334               */
	SIU_CLOCK_DIV_BY_335 = 334U, /*!< Divided by 335               */
	SIU_CLOCK_DIV_BY_336 = 335U, /*!< Divided by 336               */
	SIU_CLOCK_DIV_BY_337 = 336U, /*!< Divided by 337               */
	SIU_CLOCK_DIV_BY_338 = 337U, /*!< Divided by 338               */
	SIU_CLOCK_DIV_BY_339 = 338U, /*!< Divided by 339               */
	SIU_CLOCK_DIV_BY_340 = 339U, /*!< Divided by 340               */
	SIU_CLOCK_DIV_BY_341 = 340U, /*!< Divided by 341               */
	SIU_CLOCK_DIV_BY_342 = 341U, /*!< Divided by 342               */
	SIU_CLOCK_DIV_BY_343 = 342U, /*!< Divided by 343               */
	SIU_CLOCK_DIV_BY_344 = 343U, /*!< Divided by 344               */
	SIU_CLOCK_DIV_BY_345 = 344U, /*!< Divided by 345               */
	SIU_CLOCK_DIV_BY_346 = 345U, /*!< Divided by 346               */
	SIU_CLOCK_DIV_BY_347 = 346U, /*!< Divided by 347               */
	SIU_CLOCK_DIV_BY_348 = 347U, /*!< Divided by 348               */
	SIU_CLOCK_DIV_BY_349 = 348U, /*!< Divided by 349               */
	SIU_CLOCK_DIV_BY_350 = 349U, /*!< Divided by 350               */
	SIU_CLOCK_DIV_BY_351 = 350U, /*!< Divided by 351               */
	SIU_CLOCK_DIV_BY_352 = 351U, /*!< Divided by 352               */
	SIU_CLOCK_DIV_BY_353 = 352U, /*!< Divided by 353               */
	SIU_CLOCK_DIV_BY_354 = 353U, /*!< Divided by 354               */
	SIU_CLOCK_DIV_BY_355 = 354U, /*!< Divided by 355               */
	SIU_CLOCK_DIV_BY_356 = 355U, /*!< Divided by 356               */
	SIU_CLOCK_DIV_BY_357 = 356U, /*!< Divided by 357               */
	SIU_CLOCK_DIV_BY_358 = 357U, /*!< Divided by 358               */
	SIU_CLOCK_DIV_BY_359 = 358U, /*!< Divided by 359               */
	SIU_CLOCK_DIV_BY_360 = 359U, /*!< Divided by 360               */
	SIU_CLOCK_DIV_BY_361 = 360U, /*!< Divided by 361               */
	SIU_CLOCK_DIV_BY_362 = 361U, /*!< Divided by 362               */
	SIU_CLOCK_DIV_BY_363 = 362U, /*!< Divided by 363               */
	SIU_CLOCK_DIV_BY_364 = 363U, /*!< Divided by 364               */
	SIU_CLOCK_DIV_BY_365 = 364U, /*!< Divided by 365               */
	SIU_CLOCK_DIV_BY_366 = 365U, /*!< Divided by 366               */
	SIU_CLOCK_DIV_BY_367 = 366U, /*!< Divided by 367               */
	SIU_CLOCK_DIV_BY_368 = 367U, /*!< Divided by 368               */
	SIU_CLOCK_DIV_BY_369 = 368U, /*!< Divided by 369               */
	SIU_CLOCK_DIV_BY_370 = 369U, /*!< Divided by 370               */
	SIU_CLOCK_DIV_BY_371 = 370U, /*!< Divided by 371               */
	SIU_CLOCK_DIV_BY_372 = 371U, /*!< Divided by 372               */
	SIU_CLOCK_DIV_BY_373 = 372U, /*!< Divided by 373               */
	SIU_CLOCK_DIV_BY_374 = 373U, /*!< Divided by 374               */
	SIU_CLOCK_DIV_BY_375 = 374U, /*!< Divided by 375               */
	SIU_CLOCK_DIV_BY_376 = 375U, /*!< Divided by 376               */
	SIU_CLOCK_DIV_BY_377 = 376U, /*!< Divided by 377               */
	SIU_CLOCK_DIV_BY_378 = 377U, /*!< Divided by 378               */
	SIU_CLOCK_DIV_BY_379 = 378U, /*!< Divided by 379               */
	SIU_CLOCK_DIV_BY_380 = 379U, /*!< Divided by 380               */
	SIU_CLOCK_DIV_BY_381 = 380U, /*!< Divided by 381               */
	SIU_CLOCK_DIV_BY_382 = 381U, /*!< Divided by 382               */
	SIU_CLOCK_DIV_BY_383 = 382U, /*!< Divided by 383               */
	SIU_CLOCK_DIV_BY_384 = 383U, /*!< Divided by 384               */
	SIU_CLOCK_DIV_BY_385 = 384U, /*!< Divided by 385               */
	SIU_CLOCK_DIV_BY_386 = 385U, /*!< Divided by 386               */
	SIU_CLOCK_DIV_BY_387 = 386U, /*!< Divided by 387               */
	SIU_CLOCK_DIV_BY_388 = 387U, /*!< Divided by 388               */
	SIU_CLOCK_DIV_BY_389 = 388U, /*!< Divided by 389               */
	SIU_CLOCK_DIV_BY_390 = 389U, /*!< Divided by 390               */
	SIU_CLOCK_DIV_BY_391 = 390U, /*!< Divided by 391               */
	SIU_CLOCK_DIV_BY_392 = 391U, /*!< Divided by 392               */
	SIU_CLOCK_DIV_BY_393 = 392U, /*!< Divided by 393               */
	SIU_CLOCK_DIV_BY_394 = 393U, /*!< Divided by 394               */
	SIU_CLOCK_DIV_BY_395 = 394U, /*!< Divided by 395               */
	SIU_CLOCK_DIV_BY_396 = 395U, /*!< Divided by 396               */
	SIU_CLOCK_DIV_BY_397 = 396U, /*!< Divided by 397               */
	SIU_CLOCK_DIV_BY_398 = 397U, /*!< Divided by 398               */
	SIU_CLOCK_DIV_BY_399 = 398U, /*!< Divided by 399               */
	SIU_CLOCK_DIV_BY_400 = 399U, /*!< Divided by 400               */
	SIU_CLOCK_DIV_BY_401 = 400U, /*!< Divided by 401               */
	SIU_CLOCK_DIV_BY_402 = 401U, /*!< Divided by 402               */
	SIU_CLOCK_DIV_BY_403 = 402U, /*!< Divided by 403               */
	SIU_CLOCK_DIV_BY_404 = 403U, /*!< Divided by 404               */
	SIU_CLOCK_DIV_BY_405 = 404U, /*!< Divided by 405               */
	SIU_CLOCK_DIV_BY_406 = 405U, /*!< Divided by 406               */
	SIU_CLOCK_DIV_BY_407 = 406U, /*!< Divided by 407               */
	SIU_CLOCK_DIV_BY_408 = 407U, /*!< Divided by 408               */
	SIU_CLOCK_DIV_BY_409 = 408U, /*!< Divided by 409               */
	SIU_CLOCK_DIV_BY_410 = 409U, /*!< Divided by 410               */
	SIU_CLOCK_DIV_BY_411 = 410U, /*!< Divided by 411               */
	SIU_CLOCK_DIV_BY_412 = 411U, /*!< Divided by 412               */
	SIU_CLOCK_DIV_BY_413 = 412U, /*!< Divided by 413               */
	SIU_CLOCK_DIV_BY_414 = 413U, /*!< Divided by 414               */
	SIU_CLOCK_DIV_BY_415 = 414U, /*!< Divided by 415               */
	SIU_CLOCK_DIV_BY_416 = 415U, /*!< Divided by 416               */
	SIU_CLOCK_DIV_BY_417 = 416U, /*!< Divided by 417               */
	SIU_CLOCK_DIV_BY_418 = 417U, /*!< Divided by 418               */
	SIU_CLOCK_DIV_BY_419 = 418U, /*!< Divided by 419               */
	SIU_CLOCK_DIV_BY_420 = 419U, /*!< Divided by 420               */
	SIU_CLOCK_DIV_BY_421 = 420U, /*!< Divided by 421               */
	SIU_CLOCK_DIV_BY_422 = 421U, /*!< Divided by 422               */
	SIU_CLOCK_DIV_BY_423 = 422U, /*!< Divided by 423               */
	SIU_CLOCK_DIV_BY_424 = 423U, /*!< Divided by 424               */
	SIU_CLOCK_DIV_BY_425 = 424U, /*!< Divided by 425               */
	SIU_CLOCK_DIV_BY_426 = 425U, /*!< Divided by 426               */
	SIU_CLOCK_DIV_BY_427 = 426U, /*!< Divided by 427               */
	SIU_CLOCK_DIV_BY_428 = 427U, /*!< Divided by 428               */
	SIU_CLOCK_DIV_BY_429 = 428U, /*!< Divided by 429               */
	SIU_CLOCK_DIV_BY_430 = 429U, /*!< Divided by 430               */
	SIU_CLOCK_DIV_BY_431 = 430U, /*!< Divided by 431               */
	SIU_CLOCK_DIV_BY_432 = 431U, /*!< Divided by 432               */
	SIU_CLOCK_DIV_BY_433 = 432U, /*!< Divided by 433               */
	SIU_CLOCK_DIV_BY_434 = 433U, /*!< Divided by 434               */
	SIU_CLOCK_DIV_BY_435 = 434U, /*!< Divided by 435               */
	SIU_CLOCK_DIV_BY_436 = 435U, /*!< Divided by 436               */
	SIU_CLOCK_DIV_BY_437 = 436U, /*!< Divided by 437               */
	SIU_CLOCK_DIV_BY_438 = 437U, /*!< Divided by 438               */
	SIU_CLOCK_DIV_BY_439 = 438U, /*!< Divided by 439               */
	SIU_CLOCK_DIV_BY_440 = 439U, /*!< Divided by 440               */
	SIU_CLOCK_DIV_BY_441 = 440U, /*!< Divided by 441               */
	SIU_CLOCK_DIV_BY_442 = 441U, /*!< Divided by 442               */
	SIU_CLOCK_DIV_BY_443 = 442U, /*!< Divided by 443               */
	SIU_CLOCK_DIV_BY_444 = 443U, /*!< Divided by 444               */
	SIU_CLOCK_DIV_BY_445 = 444U, /*!< Divided by 445               */
	SIU_CLOCK_DIV_BY_446 = 445U, /*!< Divided by 446               */
	SIU_CLOCK_DIV_BY_447 = 446U, /*!< Divided by 447               */
	SIU_CLOCK_DIV_BY_448 = 447U, /*!< Divided by 448               */
	SIU_CLOCK_DIV_BY_449 = 448U, /*!< Divided by 449               */
	SIU_CLOCK_DIV_BY_450 = 449U, /*!< Divided by 450               */
	SIU_CLOCK_DIV_BY_451 = 450U, /*!< Divided by 451               */
	SIU_CLOCK_DIV_BY_452 = 451U, /*!< Divided by 452               */
	SIU_CLOCK_DIV_BY_453 = 452U, /*!< Divided by 453               */
	SIU_CLOCK_DIV_BY_454 = 453U, /*!< Divided by 454               */
	SIU_CLOCK_DIV_BY_455 = 454U, /*!< Divided by 455               */
	SIU_CLOCK_DIV_BY_456 = 455U, /*!< Divided by 456               */
	SIU_CLOCK_DIV_BY_457 = 456U, /*!< Divided by 457               */
	SIU_CLOCK_DIV_BY_458 = 457U, /*!< Divided by 458               */
	SIU_CLOCK_DIV_BY_459 = 458U, /*!< Divided by 459               */
	SIU_CLOCK_DIV_BY_460 = 459U, /*!< Divided by 460               */
	SIU_CLOCK_DIV_BY_461 = 460U, /*!< Divided by 461               */
	SIU_CLOCK_DIV_BY_462 = 461U, /*!< Divided by 462               */
	SIU_CLOCK_DIV_BY_463 = 462U, /*!< Divided by 463               */
	SIU_CLOCK_DIV_BY_464 = 463U, /*!< Divided by 464               */
	SIU_CLOCK_DIV_BY_465 = 464U, /*!< Divided by 465               */
	SIU_CLOCK_DIV_BY_466 = 465U, /*!< Divided by 466               */
	SIU_CLOCK_DIV_BY_467 = 466U, /*!< Divided by 467               */
	SIU_CLOCK_DIV_BY_468 = 467U, /*!< Divided by 468               */
	SIU_CLOCK_DIV_BY_469 = 468U, /*!< Divided by 469               */
	SIU_CLOCK_DIV_BY_470 = 469U, /*!< Divided by 470               */
	SIU_CLOCK_DIV_BY_471 = 470U, /*!< Divided by 471               */
	SIU_CLOCK_DIV_BY_472 = 471U, /*!< Divided by 472               */
	SIU_CLOCK_DIV_BY_473 = 472U, /*!< Divided by 473               */
	SIU_CLOCK_DIV_BY_474 = 473U, /*!< Divided by 474               */
	SIU_CLOCK_DIV_BY_475 = 474U, /*!< Divided by 475               */
	SIU_CLOCK_DIV_BY_476 = 475U, /*!< Divided by 476               */
	SIU_CLOCK_DIV_BY_477 = 476U, /*!< Divided by 477               */
	SIU_CLOCK_DIV_BY_478 = 477U, /*!< Divided by 478               */
	SIU_CLOCK_DIV_BY_479 = 478U, /*!< Divided by 479               */
	SIU_CLOCK_DIV_BY_480 = 479U, /*!< Divided by 480               */
	SIU_CLOCK_DIV_BY_481 = 480U, /*!< Divided by 481               */
	SIU_CLOCK_DIV_BY_482 = 481U, /*!< Divided by 482               */
	SIU_CLOCK_DIV_BY_483 = 482U, /*!< Divided by 483               */
	SIU_CLOCK_DIV_BY_484 = 483U, /*!< Divided by 484               */
	SIU_CLOCK_DIV_BY_485 = 484U, /*!< Divided by 485               */
	SIU_CLOCK_DIV_BY_486 = 485U, /*!< Divided by 486               */
	SIU_CLOCK_DIV_BY_487 = 486U, /*!< Divided by 487               */
	SIU_CLOCK_DIV_BY_488 = 487U, /*!< Divided by 488               */
	SIU_CLOCK_DIV_BY_489 = 488U, /*!< Divided by 489               */
	SIU_CLOCK_DIV_BY_490 = 489U, /*!< Divided by 490               */
	SIU_CLOCK_DIV_BY_491 = 490U, /*!< Divided by 491               */
	SIU_CLOCK_DIV_BY_492 = 491U, /*!< Divided by 492               */
	SIU_CLOCK_DIV_BY_493 = 492U, /*!< Divided by 493               */
	SIU_CLOCK_DIV_BY_494 = 493U, /*!< Divided by 494               */
	SIU_CLOCK_DIV_BY_495 = 494U, /*!< Divided by 495               */
	SIU_CLOCK_DIV_BY_496 = 495U, /*!< Divided by 496               */
	SIU_CLOCK_DIV_BY_497 = 496U, /*!< Divided by 497               */
	SIU_CLOCK_DIV_BY_498 = 497U, /*!< Divided by 498               */
	SIU_CLOCK_DIV_BY_499 = 498U, /*!< Divided by 499               */
	SIU_CLOCK_DIV_BY_500 = 499U, /*!< Divided by 500               */
	SIU_CLOCK_DIV_BY_501 = 500U, /*!< Divided by 501               */
	SIU_CLOCK_DIV_BY_502 = 501U, /*!< Divided by 502               */
	SIU_CLOCK_DIV_BY_503 = 502U, /*!< Divided by 503               */
	SIU_CLOCK_DIV_BY_504 = 503U, /*!< Divided by 504               */
	SIU_CLOCK_DIV_BY_505 = 504U, /*!< Divided by 505               */
	SIU_CLOCK_DIV_BY_506 = 505U, /*!< Divided by 506               */
	SIU_CLOCK_DIV_BY_507 = 506U, /*!< Divided by 507               */
	SIU_CLOCK_DIV_BY_508 = 507U, /*!< Divided by 508               */
	SIU_CLOCK_DIV_BY_509 = 508U, /*!< Divided by 509               */
	SIU_CLOCK_DIV_BY_510 = 509U, /*!< Divided by 510               */
	SIU_CLOCK_DIV_BY_511 = 510U, /*!< Divided by 511               */
	SIU_CLOCK_DIV_BY_512 = 511U, /*!< Divided by 512               */
	SIU_CLOCK_DIV_BY_513 = 512U, /*!< Divided by 513               */
	SIU_CLOCK_DIV_BY_514 = 513U, /*!< Divided by 514               */
	SIU_CLOCK_DIV_BY_515 = 514U, /*!< Divided by 515               */
	SIU_CLOCK_DIV_BY_516 = 515U, /*!< Divided by 516               */
	SIU_CLOCK_DIV_BY_517 = 516U, /*!< Divided by 517               */
	SIU_CLOCK_DIV_BY_518 = 517U, /*!< Divided by 518               */
	SIU_CLOCK_DIV_BY_519 = 518U, /*!< Divided by 519               */
	SIU_CLOCK_DIV_BY_520 = 519U, /*!< Divided by 520               */
	SIU_CLOCK_DIV_BY_521 = 520U, /*!< Divided by 521               */
	SIU_CLOCK_DIV_BY_522 = 521U, /*!< Divided by 522               */
	SIU_CLOCK_DIV_BY_523 = 522U, /*!< Divided by 523               */
	SIU_CLOCK_DIV_BY_524 = 523U, /*!< Divided by 524               */
	SIU_CLOCK_DIV_BY_525 = 524U, /*!< Divided by 525               */
	SIU_CLOCK_DIV_BY_526 = 525U, /*!< Divided by 526               */
	SIU_CLOCK_DIV_BY_527 = 526U, /*!< Divided by 527               */
	SIU_CLOCK_DIV_BY_528 = 527U, /*!< Divided by 528               */
	SIU_CLOCK_DIV_BY_529 = 528U, /*!< Divided by 529               */
	SIU_CLOCK_DIV_BY_530 = 529U, /*!< Divided by 530               */
	SIU_CLOCK_DIV_BY_531 = 530U, /*!< Divided by 531               */
	SIU_CLOCK_DIV_BY_532 = 531U, /*!< Divided by 532               */
	SIU_CLOCK_DIV_BY_533 = 532U, /*!< Divided by 533               */
	SIU_CLOCK_DIV_BY_534 = 533U, /*!< Divided by 534               */
	SIU_CLOCK_DIV_BY_535 = 534U, /*!< Divided by 535               */
	SIU_CLOCK_DIV_BY_536 = 535U, /*!< Divided by 536               */
	SIU_CLOCK_DIV_BY_537 = 536U, /*!< Divided by 537               */
	SIU_CLOCK_DIV_BY_538 = 537U, /*!< Divided by 538               */
	SIU_CLOCK_DIV_BY_539 = 538U, /*!< Divided by 539               */
	SIU_CLOCK_DIV_BY_540 = 539U, /*!< Divided by 540               */
	SIU_CLOCK_DIV_BY_541 = 540U, /*!< Divided by 541               */
	SIU_CLOCK_DIV_BY_542 = 541U, /*!< Divided by 542               */
	SIU_CLOCK_DIV_BY_543 = 542U, /*!< Divided by 543               */
	SIU_CLOCK_DIV_BY_544 = 543U, /*!< Divided by 544               */
	SIU_CLOCK_DIV_BY_545 = 544U, /*!< Divided by 545               */
	SIU_CLOCK_DIV_BY_546 = 545U, /*!< Divided by 546               */
	SIU_CLOCK_DIV_BY_547 = 546U, /*!< Divided by 547               */
	SIU_CLOCK_DIV_BY_548 = 547U, /*!< Divided by 548               */
	SIU_CLOCK_DIV_BY_549 = 548U, /*!< Divided by 549               */
	SIU_CLOCK_DIV_BY_550 = 549U, /*!< Divided by 550               */
	SIU_CLOCK_DIV_BY_551 = 550U, /*!< Divided by 551               */
	SIU_CLOCK_DIV_BY_552 = 551U, /*!< Divided by 552               */
	SIU_CLOCK_DIV_BY_553 = 552U, /*!< Divided by 553               */
	SIU_CLOCK_DIV_BY_554 = 553U, /*!< Divided by 554               */
	SIU_CLOCK_DIV_BY_555 = 554U, /*!< Divided by 555               */
	SIU_CLOCK_DIV_BY_556 = 555U, /*!< Divided by 556               */
	SIU_CLOCK_DIV_BY_557 = 556U, /*!< Divided by 557               */
	SIU_CLOCK_DIV_BY_558 = 557U, /*!< Divided by 558               */
	SIU_CLOCK_DIV_BY_559 = 558U, /*!< Divided by 559               */
	SIU_CLOCK_DIV_BY_560 = 559U, /*!< Divided by 560               */
	SIU_CLOCK_DIV_BY_561 = 560U, /*!< Divided by 561               */
	SIU_CLOCK_DIV_BY_562 = 561U, /*!< Divided by 562               */
	SIU_CLOCK_DIV_BY_563 = 562U, /*!< Divided by 563               */
	SIU_CLOCK_DIV_BY_564 = 563U, /*!< Divided by 564               */
	SIU_CLOCK_DIV_BY_565 = 564U, /*!< Divided by 565               */
	SIU_CLOCK_DIV_BY_566 = 565U, /*!< Divided by 566               */
	SIU_CLOCK_DIV_BY_567 = 566U, /*!< Divided by 567               */
	SIU_CLOCK_DIV_BY_568 = 567U, /*!< Divided by 568               */
	SIU_CLOCK_DIV_BY_569 = 568U, /*!< Divided by 569               */
	SIU_CLOCK_DIV_BY_570 = 569U, /*!< Divided by 570               */
	SIU_CLOCK_DIV_BY_571 = 570U, /*!< Divided by 571               */
	SIU_CLOCK_DIV_BY_572 = 571U, /*!< Divided by 572               */
	SIU_CLOCK_DIV_BY_573 = 572U, /*!< Divided by 573               */
	SIU_CLOCK_DIV_BY_574 = 573U, /*!< Divided by 574               */
	SIU_CLOCK_DIV_BY_575 = 574U, /*!< Divided by 575               */
	SIU_CLOCK_DIV_BY_576 = 575U, /*!< Divided by 576               */
	SIU_CLOCK_DIV_BY_577 = 576U, /*!< Divided by 577               */
	SIU_CLOCK_DIV_BY_578 = 577U, /*!< Divided by 578               */
	SIU_CLOCK_DIV_BY_579 = 578U, /*!< Divided by 579               */
	SIU_CLOCK_DIV_BY_580 = 579U, /*!< Divided by 580               */
	SIU_CLOCK_DIV_BY_581 = 580U, /*!< Divided by 581               */
	SIU_CLOCK_DIV_BY_582 = 581U, /*!< Divided by 582               */
	SIU_CLOCK_DIV_BY_583 = 582U, /*!< Divided by 583               */
	SIU_CLOCK_DIV_BY_584 = 583U, /*!< Divided by 584               */
	SIU_CLOCK_DIV_BY_585 = 584U, /*!< Divided by 585               */
	SIU_CLOCK_DIV_BY_586 = 585U, /*!< Divided by 586               */
	SIU_CLOCK_DIV_BY_587 = 586U, /*!< Divided by 587               */
	SIU_CLOCK_DIV_BY_588 = 587U, /*!< Divided by 588               */
	SIU_CLOCK_DIV_BY_589 = 588U, /*!< Divided by 589               */
	SIU_CLOCK_DIV_BY_590 = 589U, /*!< Divided by 590               */
	SIU_CLOCK_DIV_BY_591 = 590U, /*!< Divided by 591               */
	SIU_CLOCK_DIV_BY_592 = 591U, /*!< Divided by 592               */
	SIU_CLOCK_DIV_BY_593 = 592U, /*!< Divided by 593               */
	SIU_CLOCK_DIV_BY_594 = 593U, /*!< Divided by 594               */
	SIU_CLOCK_DIV_BY_595 = 594U, /*!< Divided by 595               */
	SIU_CLOCK_DIV_BY_596 = 595U, /*!< Divided by 596               */
	SIU_CLOCK_DIV_BY_597 = 596U, /*!< Divided by 597               */
	SIU_CLOCK_DIV_BY_598 = 597U, /*!< Divided by 598               */
	SIU_CLOCK_DIV_BY_599 = 598U, /*!< Divided by 599               */
	SIU_CLOCK_DIV_BY_600 = 599U, /*!< Divided by 600               */
	SIU_CLOCK_DIV_BY_601 = 600U, /*!< Divided by 601               */
	SIU_CLOCK_DIV_BY_602 = 601U, /*!< Divided by 602               */
	SIU_CLOCK_DIV_BY_603 = 602U, /*!< Divided by 603               */
	SIU_CLOCK_DIV_BY_604 = 603U, /*!< Divided by 604               */
	SIU_CLOCK_DIV_BY_605 = 604U, /*!< Divided by 605               */
	SIU_CLOCK_DIV_BY_606 = 605U, /*!< Divided by 606               */
	SIU_CLOCK_DIV_BY_607 = 606U, /*!< Divided by 607               */
	SIU_CLOCK_DIV_BY_608 = 607U, /*!< Divided by 608               */
	SIU_CLOCK_DIV_BY_609 = 608U, /*!< Divided by 609               */
	SIU_CLOCK_DIV_BY_610 = 609U, /*!< Divided by 610               */
	SIU_CLOCK_DIV_BY_611 = 610U, /*!< Divided by 611               */
	SIU_CLOCK_DIV_BY_612 = 611U, /*!< Divided by 612               */
	SIU_CLOCK_DIV_BY_613 = 612U, /*!< Divided by 613               */
	SIU_CLOCK_DIV_BY_614 = 613U, /*!< Divided by 614               */
	SIU_CLOCK_DIV_BY_615 = 614U, /*!< Divided by 615               */
	SIU_CLOCK_DIV_BY_616 = 615U, /*!< Divided by 616               */
	SIU_CLOCK_DIV_BY_617 = 616U, /*!< Divided by 617               */
	SIU_CLOCK_DIV_BY_618 = 617U, /*!< Divided by 618               */
	SIU_CLOCK_DIV_BY_619 = 618U, /*!< Divided by 619               */
	SIU_CLOCK_DIV_BY_620 = 619U, /*!< Divided by 620               */
	SIU_CLOCK_DIV_BY_621 = 620U, /*!< Divided by 621               */
	SIU_CLOCK_DIV_BY_622 = 621U, /*!< Divided by 622               */
	SIU_CLOCK_DIV_BY_623 = 622U, /*!< Divided by 623               */
	SIU_CLOCK_DIV_BY_624 = 623U, /*!< Divided by 624               */
	SIU_CLOCK_DIV_BY_625 = 624U, /*!< Divided by 625               */
	SIU_CLOCK_DIV_BY_626 = 625U, /*!< Divided by 626               */
	SIU_CLOCK_DIV_BY_627 = 626U, /*!< Divided by 627               */
	SIU_CLOCK_DIV_BY_628 = 627U, /*!< Divided by 628               */
	SIU_CLOCK_DIV_BY_629 = 628U, /*!< Divided by 629               */
	SIU_CLOCK_DIV_BY_630 = 629U, /*!< Divided by 630               */
	SIU_CLOCK_DIV_BY_631 = 630U, /*!< Divided by 631               */
	SIU_CLOCK_DIV_BY_632 = 631U, /*!< Divided by 632               */
	SIU_CLOCK_DIV_BY_633 = 632U, /*!< Divided by 633               */
	SIU_CLOCK_DIV_BY_634 = 633U, /*!< Divided by 634               */
	SIU_CLOCK_DIV_BY_635 = 634U, /*!< Divided by 635               */
	SIU_CLOCK_DIV_BY_636 = 635U, /*!< Divided by 636               */
	SIU_CLOCK_DIV_BY_637 = 636U, /*!< Divided by 637               */
	SIU_CLOCK_DIV_BY_638 = 637U, /*!< Divided by 638               */
	SIU_CLOCK_DIV_BY_639 = 638U, /*!< Divided by 639               */
	SIU_CLOCK_DIV_BY_640 = 639U, /*!< Divided by 640               */
	SIU_CLOCK_DIV_BY_641 = 640U, /*!< Divided by 641               */
	SIU_CLOCK_DIV_BY_642 = 641U, /*!< Divided by 642               */
	SIU_CLOCK_DIV_BY_643 = 642U, /*!< Divided by 643               */
	SIU_CLOCK_DIV_BY_644 = 643U, /*!< Divided by 644               */
	SIU_CLOCK_DIV_BY_645 = 644U, /*!< Divided by 645               */
	SIU_CLOCK_DIV_BY_646 = 645U, /*!< Divided by 646               */
	SIU_CLOCK_DIV_BY_647 = 646U, /*!< Divided by 647               */
	SIU_CLOCK_DIV_BY_648 = 647U, /*!< Divided by 648               */
	SIU_CLOCK_DIV_BY_649 = 648U, /*!< Divided by 649               */
	SIU_CLOCK_DIV_BY_650 = 649U, /*!< Divided by 650               */
	SIU_CLOCK_DIV_BY_651 = 650U, /*!< Divided by 651               */
	SIU_CLOCK_DIV_BY_652 = 651U, /*!< Divided by 652               */
	SIU_CLOCK_DIV_BY_653 = 652U, /*!< Divided by 653               */
	SIU_CLOCK_DIV_BY_654 = 653U, /*!< Divided by 654               */
	SIU_CLOCK_DIV_BY_655 = 654U, /*!< Divided by 655               */
	SIU_CLOCK_DIV_BY_656 = 655U, /*!< Divided by 656               */
	SIU_CLOCK_DIV_BY_657 = 656U, /*!< Divided by 657               */
	SIU_CLOCK_DIV_BY_658 = 657U, /*!< Divided by 658               */
	SIU_CLOCK_DIV_BY_659 = 658U, /*!< Divided by 659               */
	SIU_CLOCK_DIV_BY_660 = 659U, /*!< Divided by 660               */
	SIU_CLOCK_DIV_BY_661 = 660U, /*!< Divided by 661               */
	SIU_CLOCK_DIV_BY_662 = 661U, /*!< Divided by 662               */
	SIU_CLOCK_DIV_BY_663 = 662U, /*!< Divided by 663               */
	SIU_CLOCK_DIV_BY_664 = 663U, /*!< Divided by 664               */
	SIU_CLOCK_DIV_BY_665 = 664U, /*!< Divided by 665               */
	SIU_CLOCK_DIV_BY_666 = 665U, /*!< Divided by 666               */
	SIU_CLOCK_DIV_BY_667 = 666U, /*!< Divided by 667               */
	SIU_CLOCK_DIV_BY_668 = 667U, /*!< Divided by 668               */
	SIU_CLOCK_DIV_BY_669 = 668U, /*!< Divided by 669               */
	SIU_CLOCK_DIV_BY_670 = 669U, /*!< Divided by 670               */
	SIU_CLOCK_DIV_BY_671 = 670U, /*!< Divided by 671               */
	SIU_CLOCK_DIV_BY_672 = 671U, /*!< Divided by 672               */
	SIU_CLOCK_DIV_BY_673 = 672U, /*!< Divided by 673               */
	SIU_CLOCK_DIV_BY_674 = 673U, /*!< Divided by 674               */
	SIU_CLOCK_DIV_BY_675 = 674U, /*!< Divided by 675               */
	SIU_CLOCK_DIV_BY_676 = 675U, /*!< Divided by 676               */
	SIU_CLOCK_DIV_BY_677 = 676U, /*!< Divided by 677               */
	SIU_CLOCK_DIV_BY_678 = 677U, /*!< Divided by 678               */
	SIU_CLOCK_DIV_BY_679 = 678U, /*!< Divided by 679               */
	SIU_CLOCK_DIV_BY_680 = 679U, /*!< Divided by 680               */
	SIU_CLOCK_DIV_BY_681 = 680U, /*!< Divided by 681               */
	SIU_CLOCK_DIV_BY_682 = 681U, /*!< Divided by 682               */
