newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.h
	SIU_CLOCK_DIV_BY_683 = 682U, /*!< Divided by 683               */
	SIU_CLOCK_DIV_BY_684 = 683U, /*!< Divided by 684               */
	SIU_CLOCK_DIV_BY_685 = 684U, /*!< Divided by 685               */
	SIU_CLOCK_DIV_BY_686 = 685U, /*!< Divided by 686               */
	SIU_CLOCK_DIV_BY_687 = 686U, /*!< Divided by 687               */
	SIU_CLOCK_DIV_BY_688 = 687U, /*!< Divided by 688               */
	SIU_CLOCK_DIV_BY_689 = 688U, /*!< Divided by 689               */
	SIU_CLOCK_DIV_BY_690 = 689U, /*!< Divided by 690               */
	SIU_CLOCK_DIV_BY_691 = 690U, /*!< Divided by 691               */
	SIU_CLOCK_DIV_BY_692 = 691U, /*!< Divided by 692               */
	SIU_CLOCK_DIV_BY_693 = 692U, /*!< Divided by 693               */
	SIU_CLOCK_DIV_BY_694 = 693U, /*!< Divided by 694               */
	SIU_CLOCK_DIV_BY_695 = 694U, /*!< Divided by 695               */
	SIU_CLOCK_DIV_BY_696 = 695U, /*!< Divided by 696               */
	SIU_CLOCK_DIV_BY_697 = 696U, /*!< Divided by 697               */
	SIU_CLOCK_DIV_BY_698 = 697U, /*!< Divided by 698               */
	SIU_CLOCK_DIV_BY_699 = 698U, /*!< Divided by 699               */
	SIU_CLOCK_DIV_BY_700 = 699U, /*!< Divided by 700               */
	SIU_CLOCK_DIV_BY_701 = 700U, /*!< Divided by 701               */
	SIU_CLOCK_DIV_BY_702 = 701U, /*!< Divided by 702               */
	SIU_CLOCK_DIV_BY_703 = 702U, /*!< Divided by 703               */
	SIU_CLOCK_DIV_BY_704 = 703U, /*!< Divided by 704               */
	SIU_CLOCK_DIV_BY_705 = 704U, /*!< Divided by 705               */
	SIU_CLOCK_DIV_BY_706 = 705U, /*!< Divided by 706               */
	SIU_CLOCK_DIV_BY_707 = 706U, /*!< Divided by 707               */
	SIU_CLOCK_DIV_BY_708 = 707U, /*!< Divided by 708               */
	SIU_CLOCK_DIV_BY_709 = 708U, /*!< Divided by 709               */
	SIU_CLOCK_DIV_BY_710 = 709U, /*!< Divided by 710               */
	SIU_CLOCK_DIV_BY_711 = 710U, /*!< Divided by 711               */
	SIU_CLOCK_DIV_BY_712 = 711U, /*!< Divided by 712               */
	SIU_CLOCK_DIV_BY_713 = 712U, /*!< Divided by 713               */
	SIU_CLOCK_DIV_BY_714 = 713U, /*!< Divided by 714               */
	SIU_CLOCK_DIV_BY_715 = 714U, /*!< Divided by 715               */
	SIU_CLOCK_DIV_BY_716 = 715U, /*!< Divided by 716               */
	SIU_CLOCK_DIV_BY_717 = 716U, /*!< Divided by 717               */
	SIU_CLOCK_DIV_BY_718 = 717U, /*!< Divided by 718               */
	SIU_CLOCK_DIV_BY_719 = 718U, /*!< Divided by 719               */
	SIU_CLOCK_DIV_BY_720 = 719U, /*!< Divided by 720               */
	SIU_CLOCK_DIV_BY_721 = 720U, /*!< Divided by 721               */
	SIU_CLOCK_DIV_BY_722 = 721U, /*!< Divided by 722               */
	SIU_CLOCK_DIV_BY_723 = 722U, /*!< Divided by 723               */
	SIU_CLOCK_DIV_BY_724 = 723U, /*!< Divided by 724               */
	SIU_CLOCK_DIV_BY_725 = 724U, /*!< Divided by 725               */
	SIU_CLOCK_DIV_BY_726 = 725U, /*!< Divided by 726               */
	SIU_CLOCK_DIV_BY_727 = 726U, /*!< Divided by 727               */
	SIU_CLOCK_DIV_BY_728 = 727U, /*!< Divided by 728               */
	SIU_CLOCK_DIV_BY_729 = 728U, /*!< Divided by 729               */
	SIU_CLOCK_DIV_BY_730 = 729U, /*!< Divided by 730               */
	SIU_CLOCK_DIV_BY_731 = 730U, /*!< Divided by 731               */
	SIU_CLOCK_DIV_BY_732 = 731U, /*!< Divided by 732               */
	SIU_CLOCK_DIV_BY_733 = 732U, /*!< Divided by 733               */
	SIU_CLOCK_DIV_BY_734 = 733U, /*!< Divided by 734               */
	SIU_CLOCK_DIV_BY_735 = 734U, /*!< Divided by 735               */
	SIU_CLOCK_DIV_BY_736 = 735U, /*!< Divided by 736               */
	SIU_CLOCK_DIV_BY_737 = 736U, /*!< Divided by 737               */
	SIU_CLOCK_DIV_BY_738 = 737U, /*!< Divided by 738               */
	SIU_CLOCK_DIV_BY_739 = 738U, /*!< Divided by 739               */
	SIU_CLOCK_DIV_BY_740 = 739U, /*!< Divided by 740               */
	SIU_CLOCK_DIV_BY_741 = 740U, /*!< Divided by 741               */
	SIU_CLOCK_DIV_BY_742 = 741U, /*!< Divided by 742               */
	SIU_CLOCK_DIV_BY_743 = 742U, /*!< Divided by 743               */
	SIU_CLOCK_DIV_BY_744 = 743U, /*!< Divided by 744               */
	SIU_CLOCK_DIV_BY_745 = 744U, /*!< Divided by 745               */
	SIU_CLOCK_DIV_BY_746 = 745U, /*!< Divided by 746               */
	SIU_CLOCK_DIV_BY_747 = 746U, /*!< Divided by 747               */
	SIU_CLOCK_DIV_BY_748 = 747U, /*!< Divided by 748               */
	SIU_CLOCK_DIV_BY_749 = 748U, /*!< Divided by 749               */
	SIU_CLOCK_DIV_BY_750 = 749U, /*!< Divided by 750               */
	SIU_CLOCK_DIV_BY_751 = 750U, /*!< Divided by 751               */
	SIU_CLOCK_DIV_BY_752 = 751U, /*!< Divided by 752               */
	SIU_CLOCK_DIV_BY_753 = 752U, /*!< Divided by 753               */
	SIU_CLOCK_DIV_BY_754 = 753U, /*!< Divided by 754               */
	SIU_CLOCK_DIV_BY_755 = 754U, /*!< Divided by 755               */
	SIU_CLOCK_DIV_BY_756 = 755U, /*!< Divided by 756               */
	SIU_CLOCK_DIV_BY_757 = 756U, /*!< Divided by 757               */
	SIU_CLOCK_DIV_BY_758 = 757U, /*!< Divided by 758               */
	SIU_CLOCK_DIV_BY_759 = 758U, /*!< Divided by 759               */
	SIU_CLOCK_DIV_BY_760 = 759U, /*!< Divided by 760               */
	SIU_CLOCK_DIV_BY_761 = 760U, /*!< Divided by 761               */
	SIU_CLOCK_DIV_BY_762 = 761U, /*!< Divided by 762               */
	SIU_CLOCK_DIV_BY_763 = 762U, /*!< Divided by 763               */
	SIU_CLOCK_DIV_BY_764 = 763U, /*!< Divided by 764               */
	SIU_CLOCK_DIV_BY_765 = 764U, /*!< Divided by 765               */
	SIU_CLOCK_DIV_BY_766 = 765U, /*!< Divided by 766               */
	SIU_CLOCK_DIV_BY_767 = 766U, /*!< Divided by 767               */
	SIU_CLOCK_DIV_BY_768 = 767U, /*!< Divided by 768               */
	SIU_CLOCK_DIV_BY_769 = 768U, /*!< Divided by 769               */
	SIU_CLOCK_DIV_BY_770 = 769U, /*!< Divided by 770               */
	SIU_CLOCK_DIV_BY_771 = 770U, /*!< Divided by 771               */
	SIU_CLOCK_DIV_BY_772 = 771U, /*!< Divided by 772               */
	SIU_CLOCK_DIV_BY_773 = 772U, /*!< Divided by 773               */
	SIU_CLOCK_DIV_BY_774 = 773U, /*!< Divided by 774               */
	SIU_CLOCK_DIV_BY_775 = 774U, /*!< Divided by 775               */
	SIU_CLOCK_DIV_BY_776 = 775U, /*!< Divided by 776               */
	SIU_CLOCK_DIV_BY_777 = 776U, /*!< Divided by 777               */
	SIU_CLOCK_DIV_BY_778 = 777U, /*!< Divided by 778               */
	SIU_CLOCK_DIV_BY_779 = 778U, /*!< Divided by 779               */
	SIU_CLOCK_DIV_BY_780 = 779U, /*!< Divided by 780               */
	SIU_CLOCK_DIV_BY_781 = 780U, /*!< Divided by 781               */
	SIU_CLOCK_DIV_BY_782 = 781U, /*!< Divided by 782               */
	SIU_CLOCK_DIV_BY_783 = 782U, /*!< Divided by 783               */
	SIU_CLOCK_DIV_BY_784 = 783U, /*!< Divided by 784               */
	SIU_CLOCK_DIV_BY_785 = 784U, /*!< Divided by 785               */
	SIU_CLOCK_DIV_BY_786 = 785U, /*!< Divided by 786               */
	SIU_CLOCK_DIV_BY_787 = 786U, /*!< Divided by 787               */
	SIU_CLOCK_DIV_BY_788 = 787U, /*!< Divided by 788               */
	SIU_CLOCK_DIV_BY_789 = 788U, /*!< Divided by 789               */
	SIU_CLOCK_DIV_BY_790 = 789U, /*!< Divided by 790               */
	SIU_CLOCK_DIV_BY_791 = 790U, /*!< Divided by 791               */
	SIU_CLOCK_DIV_BY_792 = 791U, /*!< Divided by 792               */
	SIU_CLOCK_DIV_BY_793 = 792U, /*!< Divided by 793               */
	SIU_CLOCK_DIV_BY_794 = 793U, /*!< Divided by 794               */
	SIU_CLOCK_DIV_BY_795 = 794U, /*!< Divided by 795               */
	SIU_CLOCK_DIV_BY_796 = 795U, /*!< Divided by 796               */
	SIU_CLOCK_DIV_BY_797 = 796U, /*!< Divided by 797               */
	SIU_CLOCK_DIV_BY_798 = 797U, /*!< Divided by 798               */
	SIU_CLOCK_DIV_BY_799 = 798U, /*!< Divided by 799               */
	SIU_CLOCK_DIV_BY_800 = 799U, /*!< Divided by 800               */
	SIU_CLOCK_DIV_BY_801 = 800U, /*!< Divided by 801               */
	SIU_CLOCK_DIV_BY_802 = 801U, /*!< Divided by 802               */
	SIU_CLOCK_DIV_BY_803 = 802U, /*!< Divided by 803               */
	SIU_CLOCK_DIV_BY_804 = 803U, /*!< Divided by 804               */
	SIU_CLOCK_DIV_BY_805 = 804U, /*!< Divided by 805               */
	SIU_CLOCK_DIV_BY_806 = 805U, /*!< Divided by 806               */
	SIU_CLOCK_DIV_BY_807 = 806U, /*!< Divided by 807               */
	SIU_CLOCK_DIV_BY_808 = 807U, /*!< Divided by 808               */
	SIU_CLOCK_DIV_BY_809 = 808U, /*!< Divided by 809               */
	SIU_CLOCK_DIV_BY_810 = 809U, /*!< Divided by 810               */
	SIU_CLOCK_DIV_BY_811 = 810U, /*!< Divided by 811               */
	SIU_CLOCK_DIV_BY_812 = 811U, /*!< Divided by 812               */
	SIU_CLOCK_DIV_BY_813 = 812U, /*!< Divided by 813               */
	SIU_CLOCK_DIV_BY_814 = 813U, /*!< Divided by 814               */
	SIU_CLOCK_DIV_BY_815 = 814U, /*!< Divided by 815               */
	SIU_CLOCK_DIV_BY_816 = 815U, /*!< Divided by 816               */
	SIU_CLOCK_DIV_BY_817 = 816U, /*!< Divided by 817               */
	SIU_CLOCK_DIV_BY_818 = 817U, /*!< Divided by 818               */
	SIU_CLOCK_DIV_BY_819 = 818U, /*!< Divided by 819               */
	SIU_CLOCK_DIV_BY_820 = 819U, /*!< Divided by 820               */
	SIU_CLOCK_DIV_BY_821 = 820U, /*!< Divided by 821               */
	SIU_CLOCK_DIV_BY_822 = 821U, /*!< Divided by 822               */
	SIU_CLOCK_DIV_BY_823 = 822U, /*!< Divided by 823               */
	SIU_CLOCK_DIV_BY_824 = 823U, /*!< Divided by 824               */
	SIU_CLOCK_DIV_BY_825 = 824U, /*!< Divided by 825               */
	SIU_CLOCK_DIV_BY_826 = 825U, /*!< Divided by 826               */
	SIU_CLOCK_DIV_BY_827 = 826U, /*!< Divided by 827               */
	SIU_CLOCK_DIV_BY_828 = 827U, /*!< Divided by 828               */
	SIU_CLOCK_DIV_BY_829 = 828U, /*!< Divided by 829               */
	SIU_CLOCK_DIV_BY_830 = 829U, /*!< Divided by 830               */
	SIU_CLOCK_DIV_BY_831 = 830U, /*!< Divided by 831               */
	SIU_CLOCK_DIV_BY_832 = 831U, /*!< Divided by 832               */
	SIU_CLOCK_DIV_BY_833 = 832U, /*!< Divided by 833               */
	SIU_CLOCK_DIV_BY_834 = 833U, /*!< Divided by 834               */
	SIU_CLOCK_DIV_BY_835 = 834U, /*!< Divided by 835               */
	SIU_CLOCK_DIV_BY_836 = 835U, /*!< Divided by 836               */
	SIU_CLOCK_DIV_BY_837 = 836U, /*!< Divided by 837               */
	SIU_CLOCK_DIV_BY_838 = 837U, /*!< Divided by 838               */
	SIU_CLOCK_DIV_BY_839 = 838U, /*!< Divided by 839               */
	SIU_CLOCK_DIV_BY_840 = 839U, /*!< Divided by 840               */
	SIU_CLOCK_DIV_BY_841 = 840U, /*!< Divided by 841               */
	SIU_CLOCK_DIV_BY_842 = 841U, /*!< Divided by 842               */
	SIU_CLOCK_DIV_BY_843 = 842U, /*!< Divided by 843               */
	SIU_CLOCK_DIV_BY_844 = 843U, /*!< Divided by 844               */
	SIU_CLOCK_DIV_BY_845 = 844U, /*!< Divided by 845               */
	SIU_CLOCK_DIV_BY_846 = 845U, /*!< Divided by 846               */
	SIU_CLOCK_DIV_BY_847 = 846U, /*!< Divided by 847               */
	SIU_CLOCK_DIV_BY_848 = 847U, /*!< Divided by 848               */
	SIU_CLOCK_DIV_BY_849 = 848U, /*!< Divided by 849               */
	SIU_CLOCK_DIV_BY_850 = 849U, /*!< Divided by 850               */
	SIU_CLOCK_DIV_BY_851 = 850U, /*!< Divided by 851               */
	SIU_CLOCK_DIV_BY_852 = 851U, /*!< Divided by 852               */
	SIU_CLOCK_DIV_BY_853 = 852U, /*!< Divided by 853               */
	SIU_CLOCK_DIV_BY_854 = 853U, /*!< Divided by 854               */
	SIU_CLOCK_DIV_BY_855 = 854U, /*!< Divided by 855               */
	SIU_CLOCK_DIV_BY_856 = 855U, /*!< Divided by 856               */
	SIU_CLOCK_DIV_BY_857 = 856U, /*!< Divided by 857               */
	SIU_CLOCK_DIV_BY_858 = 857U, /*!< Divided by 858               */
	SIU_CLOCK_DIV_BY_859 = 858U, /*!< Divided by 859               */
	SIU_CLOCK_DIV_BY_860 = 859U, /*!< Divided by 860               */
	SIU_CLOCK_DIV_BY_861 = 860U, /*!< Divided by 861               */
	SIU_CLOCK_DIV_BY_862 = 861U, /*!< Divided by 862               */
	SIU_CLOCK_DIV_BY_863 = 862U, /*!< Divided by 863               */
	SIU_CLOCK_DIV_BY_864 = 863U, /*!< Divided by 864               */
	SIU_CLOCK_DIV_BY_865 = 864U, /*!< Divided by 865               */
	SIU_CLOCK_DIV_BY_866 = 865U, /*!< Divided by 866               */
	SIU_CLOCK_DIV_BY_867 = 866U, /*!< Divided by 867               */
	SIU_CLOCK_DIV_BY_868 = 867U, /*!< Divided by 868               */
	SIU_CLOCK_DIV_BY_869 = 868U, /*!< Divided by 869               */
	SIU_CLOCK_DIV_BY_870 = 869U, /*!< Divided by 870               */
	SIU_CLOCK_DIV_BY_871 = 870U, /*!< Divided by 871               */
	SIU_CLOCK_DIV_BY_872 = 871U, /*!< Divided by 872               */
	SIU_CLOCK_DIV_BY_873 = 872U, /*!< Divided by 873               */
	SIU_CLOCK_DIV_BY_874 = 873U, /*!< Divided by 874               */
	SIU_CLOCK_DIV_BY_875 = 874U, /*!< Divided by 875               */
	SIU_CLOCK_DIV_BY_876 = 875U, /*!< Divided by 876               */
	SIU_CLOCK_DIV_BY_877 = 876U, /*!< Divided by 877               */
	SIU_CLOCK_DIV_BY_878 = 877U, /*!< Divided by 878               */
	SIU_CLOCK_DIV_BY_879 = 878U, /*!< Divided by 879               */
	SIU_CLOCK_DIV_BY_880 = 879U, /*!< Divided by 880               */
	SIU_CLOCK_DIV_BY_881 = 880U, /*!< Divided by 881               */
	SIU_CLOCK_DIV_BY_882 = 881U, /*!< Divided by 882               */
	SIU_CLOCK_DIV_BY_883 = 882U, /*!< Divided by 883               */
	SIU_CLOCK_DIV_BY_884 = 883U, /*!< Divided by 884               */
	SIU_CLOCK_DIV_BY_885 = 884U, /*!< Divided by 885               */
	SIU_CLOCK_DIV_BY_886 = 885U, /*!< Divided by 886               */
	SIU_CLOCK_DIV_BY_887 = 886U, /*!< Divided by 887               */
	SIU_CLOCK_DIV_BY_888 = 887U, /*!< Divided by 888               */
	SIU_CLOCK_DIV_BY_889 = 888U, /*!< Divided by 889               */
	SIU_CLOCK_DIV_BY_890 = 889U, /*!< Divided by 890               */
	SIU_CLOCK_DIV_BY_891 = 890U, /*!< Divided by 891               */
	SIU_CLOCK_DIV_BY_892 = 891U, /*!< Divided by 892               */
	SIU_CLOCK_DIV_BY_893 = 892U, /*!< Divided by 893               */
	SIU_CLOCK_DIV_BY_894 = 893U, /*!< Divided by 894               */
	SIU_CLOCK_DIV_BY_895 = 894U, /*!< Divided by 895               */
	SIU_CLOCK_DIV_BY_896 = 895U, /*!< Divided by 896               */
	SIU_CLOCK_DIV_BY_897 = 896U, /*!< Divided by 897               */
	SIU_CLOCK_DIV_BY_898 = 897U, /*!< Divided by 898               */
	SIU_CLOCK_DIV_BY_899 = 898U, /*!< Divided by 899               */
	SIU_CLOCK_DIV_BY_900 = 899U, /*!< Divided by 900               */
	SIU_CLOCK_DIV_BY_901 = 900U, /*!< Divided by 901               */
	SIU_CLOCK_DIV_BY_902 = 901U, /*!< Divided by 902               */
	SIU_CLOCK_DIV_BY_903 = 902U, /*!< Divided by 903               */
	SIU_CLOCK_DIV_BY_904 = 903U, /*!< Divided by 904               */
	SIU_CLOCK_DIV_BY_905 = 904U, /*!< Divided by 905               */
	SIU_CLOCK_DIV_BY_906 = 905U, /*!< Divided by 906               */
	SIU_CLOCK_DIV_BY_907 = 906U, /*!< Divided by 907               */
	SIU_CLOCK_DIV_BY_908 = 907U, /*!< Divided by 908               */
	SIU_CLOCK_DIV_BY_909 = 908U, /*!< Divided by 909               */
	SIU_CLOCK_DIV_BY_910 = 909U, /*!< Divided by 910               */
	SIU_CLOCK_DIV_BY_911 = 910U, /*!< Divided by 911               */
	SIU_CLOCK_DIV_BY_912 = 911U, /*!< Divided by 912               */
	SIU_CLOCK_DIV_BY_913 = 912U, /*!< Divided by 913               */
	SIU_CLOCK_DIV_BY_914 = 913U, /*!< Divided by 914               */
	SIU_CLOCK_DIV_BY_915 = 914U, /*!< Divided by 915               */
	SIU_CLOCK_DIV_BY_916 = 915U, /*!< Divided by 916               */
	SIU_CLOCK_DIV_BY_917 = 916U, /*!< Divided by 917               */
	SIU_CLOCK_DIV_BY_918 = 917U, /*!< Divided by 918               */
	SIU_CLOCK_DIV_BY_919 = 918U, /*!< Divided by 919               */
	SIU_CLOCK_DIV_BY_920 = 919U, /*!< Divided by 920               */
	SIU_CLOCK_DIV_BY_921 = 920U, /*!< Divided by 921               */
	SIU_CLOCK_DIV_BY_922 = 921U, /*!< Divided by 922               */
	SIU_CLOCK_DIV_BY_923 = 922U, /*!< Divided by 923               */
	SIU_CLOCK_DIV_BY_924 = 923U, /*!< Divided by 924               */
	SIU_CLOCK_DIV_BY_925 = 924U, /*!< Divided by 925               */
	SIU_CLOCK_DIV_BY_926 = 925U, /*!< Divided by 926               */
	SIU_CLOCK_DIV_BY_927 = 926U, /*!< Divided by 927               */
	SIU_CLOCK_DIV_BY_928 = 927U, /*!< Divided by 928               */
	SIU_CLOCK_DIV_BY_929 = 928U, /*!< Divided by 929               */
	SIU_CLOCK_DIV_BY_930 = 929U, /*!< Divided by 930               */
	SIU_CLOCK_DIV_BY_931 = 930U, /*!< Divided by 931               */
	SIU_CLOCK_DIV_BY_932 = 931U, /*!< Divided by 932               */
	SIU_CLOCK_DIV_BY_933 = 932U, /*!< Divided by 933               */
	SIU_CLOCK_DIV_BY_934 = 933U, /*!< Divided by 934               */
	SIU_CLOCK_DIV_BY_935 = 934U, /*!< Divided by 935               */
	SIU_CLOCK_DIV_BY_936 = 935U, /*!< Divided by 936               */
	SIU_CLOCK_DIV_BY_937 = 936U, /*!< Divided by 937               */
	SIU_CLOCK_DIV_BY_938 = 937U, /*!< Divided by 938               */
	SIU_CLOCK_DIV_BY_939 = 938U, /*!< Divided by 939               */
	SIU_CLOCK_DIV_BY_940 = 939U, /*!< Divided by 940               */
	SIU_CLOCK_DIV_BY_941 = 940U, /*!< Divided by 941               */
	SIU_CLOCK_DIV_BY_942 = 941U, /*!< Divided by 942               */
	SIU_CLOCK_DIV_BY_943 = 942U, /*!< Divided by 943               */
	SIU_CLOCK_DIV_BY_944 = 943U, /*!< Divided by 944               */
	SIU_CLOCK_DIV_BY_945 = 944U, /*!< Divided by 945               */
	SIU_CLOCK_DIV_BY_946 = 945U, /*!< Divided by 946               */
	SIU_CLOCK_DIV_BY_947 = 946U, /*!< Divided by 947               */
	SIU_CLOCK_DIV_BY_948 = 947U, /*!< Divided by 948               */
	SIU_CLOCK_DIV_BY_949 = 948U, /*!< Divided by 949               */
	SIU_CLOCK_DIV_BY_950 = 949U, /*!< Divided by 950               */
	SIU_CLOCK_DIV_BY_951 = 950U, /*!< Divided by 951               */
	SIU_CLOCK_DIV_BY_952 = 951U, /*!< Divided by 952               */
	SIU_CLOCK_DIV_BY_953 = 952U, /*!< Divided by 953               */
	SIU_CLOCK_DIV_BY_954 = 953U, /*!< Divided by 954               */
	SIU_CLOCK_DIV_BY_955 = 954U, /*!< Divided by 955               */
	SIU_CLOCK_DIV_BY_956 = 955U, /*!< Divided by 956               */
	SIU_CLOCK_DIV_BY_957 = 956U, /*!< Divided by 957               */
	SIU_CLOCK_DIV_BY_958 = 957U, /*!< Divided by 958               */
	SIU_CLOCK_DIV_BY_959 = 958U, /*!< Divided by 959               */
	SIU_CLOCK_DIV_BY_960 = 959U, /*!< Divided by 960               */
	SIU_CLOCK_DIV_BY_961 = 960U, /*!< Divided by 961               */
	SIU_CLOCK_DIV_BY_962 = 961U, /*!< Divided by 962               */
	SIU_CLOCK_DIV_BY_963 = 962U, /*!< Divided by 963               */
	SIU_CLOCK_DIV_BY_964 = 963U, /*!< Divided by 964               */
	SIU_CLOCK_DIV_BY_965 = 964U, /*!< Divided by 965               */
	SIU_CLOCK_DIV_BY_966 = 965U, /*!< Divided by 966               */
	SIU_CLOCK_DIV_BY_967 = 966U, /*!< Divided by 967               */
	SIU_CLOCK_DIV_BY_968 = 967U, /*!< Divided by 968               */
	SIU_CLOCK_DIV_BY_969 = 968U, /*!< Divided by 969               */
	SIU_CLOCK_DIV_BY_970 = 969U, /*!< Divided by 970               */
	SIU_CLOCK_DIV_BY_971 = 970U, /*!< Divided by 971               */
	SIU_CLOCK_DIV_BY_972 = 971U, /*!< Divided by 972               */
	SIU_CLOCK_DIV_BY_973 = 972U, /*!< Divided by 973               */
	SIU_CLOCK_DIV_BY_974 = 973U, /*!< Divided by 974               */
	SIU_CLOCK_DIV_BY_975 = 974U, /*!< Divided by 975               */
	SIU_CLOCK_DIV_BY_976 = 975U, /*!< Divided by 976               */
	SIU_CLOCK_DIV_BY_977 = 976U, /*!< Divided by 977               */
	SIU_CLOCK_DIV_BY_978 = 977U, /*!< Divided by 978               */
	SIU_CLOCK_DIV_BY_979 = 978U, /*!< Divided by 979               */
	SIU_CLOCK_DIV_BY_980 = 979U, /*!< Divided by 980               */
	SIU_CLOCK_DIV_BY_981 = 980U, /*!< Divided by 981               */
	SIU_CLOCK_DIV_BY_982 = 981U, /*!< Divided by 982               */
	SIU_CLOCK_DIV_BY_983 = 982U, /*!< Divided by 983               */
	SIU_CLOCK_DIV_BY_984 = 983U, /*!< Divided by 984               */
	SIU_CLOCK_DIV_BY_985 = 984U, /*!< Divided by 985               */
	SIU_CLOCK_DIV_BY_986 = 985U, /*!< Divided by 986               */
	SIU_CLOCK_DIV_BY_987 = 986U, /*!< Divided by 987               */
	SIU_CLOCK_DIV_BY_988 = 987U, /*!< Divided by 988               */
	SIU_CLOCK_DIV_BY_989 = 988U, /*!< Divided by 989               */
	SIU_CLOCK_DIV_BY_990 = 989U, /*!< Divided by 990               */
	SIU_CLOCK_DIV_BY_991 = 990U, /*!< Divided by 991               */
	SIU_CLOCK_DIV_BY_992 = 991U, /*!< Divided by 992               */
	SIU_CLOCK_DIV_BY_993 = 992U, /*!< Divided by 993               */
	SIU_CLOCK_DIV_BY_994 = 993U, /*!< Divided by 994               */
	SIU_CLOCK_DIV_BY_995 = 994U, /*!< Divided by 995               */
	SIU_CLOCK_DIV_BY_996 = 995U, /*!< Divided by 996               */
	SIU_CLOCK_DIV_BY_997 = 996U, /*!< Divided by 997               */
	SIU_CLOCK_DIV_BY_998 = 997U, /*!< Divided by 998               */
	SIU_CLOCK_DIV_BY_999 = 998U, /*!< Divided by 999               */
	SIU_CLOCK_DIV_BY_1000 = 999U, /*!< Divided by 1000              */
	SIU_CLOCK_DIV_BY_1001 = 1000U, /*!< Divided by 1001              */
	SIU_CLOCK_DIV_BY_1002 = 1001U, /*!< Divided by 1002              */
	SIU_CLOCK_DIV_BY_1003 = 1002U, /*!< Divided by 1003              */
	SIU_CLOCK_DIV_BY_1004 = 1003U, /*!< Divided by 1004              */
	SIU_CLOCK_DIV_BY_1005 = 1004U, /*!< Divided by 1005              */
	SIU_CLOCK_DIV_BY_1006 = 1005U, /*!< Divided by 1006              */
	SIU_CLOCK_DIV_BY_1007 = 1006U, /*!< Divided by 1007              */
	SIU_CLOCK_DIV_BY_1008 = 1007U, /*!< Divided by 1008              */
	SIU_CLOCK_DIV_BY_1009 = 1008U, /*!< Divided by 1009              */
	SIU_CLOCK_DIV_BY_1010 = 1009U, /*!< Divided by 1010              */
	SIU_CLOCK_DIV_BY_1011 = 1010U, /*!< Divided by 1011              */
	SIU_CLOCK_DIV_BY_1012 = 1011U, /*!< Divided by 1012              */
	SIU_CLOCK_DIV_BY_1013 = 1012U, /*!< Divided by 1013              */
	SIU_CLOCK_DIV_BY_1014 = 1013U, /*!< Divided by 1014              */
	SIU_CLOCK_DIV_BY_1015 = 1014U, /*!< Divided by 1015              */
	SIU_CLOCK_DIV_BY_1016 = 1015U, /*!< Divided by 1016              */
	SIU_CLOCK_DIV_BY_1017 = 1016U, /*!< Divided by 1017              */
	SIU_CLOCK_DIV_BY_1018 = 1017U, /*!< Divided by 1018              */
	SIU_CLOCK_DIV_BY_1019 = 1018U, /*!< Divided by 1019              */
	SIU_CLOCK_DIV_BY_1020 = 1019U, /*!< Divided by 1020              */
	SIU_CLOCK_DIV_BY_1021 = 1020U, /*!< Divided by 1021              */
	SIU_CLOCK_DIV_BY_1022 = 1021U, /*!< Divided by 1022              */
	SIU_CLOCK_DIV_BY_1023 = 1022U, /*!< Divided by 1023              */
	SIU_CLOCK_DIV_BY_1024 = 1023U, /*!< Divided by 1024              */
	SIU_CLOCK_DISABLE = 1024U, /*!< Disable system clock divider */
} siu_clk_div_t;

/*!
 * @brief SIU auxiliary clock selector.
 * Implements siu_clk_sel_t_Class
 */
typedef uint8_t siu_clk_sel_t;

#define SIU_PER_CLK_SEL_CORE_CLK         0U
#define SIU_PER_CLK_SEL_PLL0_PHI0        1U

#define SIU_MCAN_CLK_SEL_XOSC_CLK         0U
#define SIU_MCAN_CLK_SEL_PER_CLK          1U

#define SIU_LFASTx_SEL_XOSC              0U
#define SIU_LFASTx_SEL_SIPI_REF_CLK      1U
#define SIU_LFASTx_SEL_PER_CLK           2U

#define PLL_REFERENCE_XOSC               0U
#define PLL_REFERENCE_IRCOSC             1U
#define PLL_REFERENCE_PLL0_PHI1          1U

#define SIU_SYSTEM_CLOCK_SRC_IRCOSC      0U
#define SIU_SYSTEM_CLOCK_SRC_XOSC        1U
#define SIU_SYSTEM_CLOCK_SRC_PLL0_PHI0   3U
#define SIU_SYSTEM_CLOCK_SRC_PLL1_PHI0   2U

#define SIU_ENG_CLOCKOUT_PLAT_CLK        0U
#define SIU_ENG_CLOCKOUT_XOSC_CLK        1U

/*!
 * @brief SIU configuration structure.
 * Implements siu_config_t_Class
 */
typedef struct {

