newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.h
	bool SIU_CSE;
	bool SIU_CRC;
	bool SIU_DSPIA;
	bool SIU_DSPIB;
	bool SIU_DSPIC;
	bool SIU_DSPID;
	bool SIU_ENET;
	bool SIU_FLEXCANA;
	bool SIU_FLEXCANB;
	bool SIU_FLEXCANC;
	bool SIU_FLEXCAND;
	bool SIU_EMIOS0;
	bool SIU_EMIOS1;
	bool SIU_PSI;
	bool SIU_ESCIA;
	bool SIU_ESCIB;
	bool SIU_ESCIC;
	bool SIU_ESCID;
	bool SIU_ESCIE;
	bool SIU_ESCIF;
	bool SIU_PSI5A;
	bool SIU_PSI5B;
	bool SIU_DECFIL;
	bool SIU_ETPUC;
	bool SIU_NPC;
	bool SIU_PIT;
	bool SIU_STCU;
	bool SIU_SRX0;
	bool SIU_SRX1;
	bool SIU_EQADCA;
	bool SIU_EQADCB;
	bool SIU_SDD;
	bool SIU_SIPI;
	bool SIU_SDA;
	bool SIU_SDB;
	bool SIU_SDC;
	bool SIU_MCANB;
	bool SIU_DSPI;
	bool SIU_EBI;
	bool SIU_ETPUA;
	bool SIU_DSPIE;
	bool SIU_MCANA;
	siu_clk_sel_t pll0Reference;
	siu_clk_sel_t pll1Reference;
	siu_clk_sel_t scs;
	siu_clk_sel_t perClkSel;
	siu_clk_sel_t lfastSel;
	siu_clk_sel_t mcanSel;
	siu_clk_sel_t engClkoutSel;
	siu_clk_div_t coreClk;
	siu_clk_div_t pbridgeClk;
	siu_clk_div_t perClk;
	siu_clk_div_t etpuClk;
	siu_clk_div_t adcsdClk;
	siu_clk_div_t psi5Rx;
	siu_clk_div_t psi5Rx1M;
	siu_clk_div_t lfastClk;
	siu_clk_div_t clkout;
	siu_clk_div_t engClkout;

} siu_config_t;

/*!
 * @brief IRC clock trimming value
 * Implements cs_irc_clk_trim_t_Class
 */
typedef enum {

	IRC_CLOCK_TRIM_BY_MINUS_15 = 31U, /*!< Trim by minus 15 */
	IRC_CLOCK_TRIM_BY_MINUS_14 = 30U, /*!< Trim by minus 14 */
	IRC_CLOCK_TRIM_BY_MINUS_13 = 29U, /*!< Trim by minus 13 */
	IRC_CLOCK_TRIM_BY_MINUS_12 = 28U, /*!< Trim by minus 12 */
	IRC_CLOCK_TRIM_BY_MINUS_11 = 27U, /*!< Trim by minus 11 */
	IRC_CLOCK_TRIM_BY_MINUS_10 = 26U, /*!< Trim by minus 10 */
	IRC_CLOCK_TRIM_BY_MINUS_9 = 25U, /*!< Trim by minus 9  */
	IRC_CLOCK_TRIM_BY_MINUS_8 = 24U, /*!< Trim by minus 8  */
	IRC_CLOCK_TRIM_BY_MINUS_7 = 23U, /*!< Trim by minus 7  */
	IRC_CLOCK_TRIM_BY_MINUS_6 = 22U, /*!< Trim by minus 6  */
	IRC_CLOCK_TRIM_BY_MINUS_5 = 21U, /*!< Trim by minus 5  */
	IRC_CLOCK_TRIM_BY_MINUS_4 = 20U, /*!< Trim by minus 4  */
	IRC_CLOCK_TRIM_BY_MINUS_3 = 19U, /*!< Trim by minus 3  */
	IRC_CLOCK_TRIM_BY_MINUS_2 = 18U, /*!< Trim by minus 2  */
	IRC_CLOCK_TRIM_BY_MINUS_1 = 17U, /*!< Trim by minus 1  */
	IRC_CLOCK_NO_TRIMMING = 16U, /*!< No trimming      */
	IRC_CLOCK_TRIM_BY_PLUS_1 = 1U, /*!< Trim by plus 1   */
	IRC_CLOCK_TRIM_BY_PLUS_2 = 2U, /*!< Trim by plus 2   */
	IRC_CLOCK_TRIM_BY_PLUS_3 = 3U, /*!< Trim by plus 3   */
	IRC_CLOCK_TRIM_BY_PLUS_4 = 4U, /*!< Trim by plus 4   */
	IRC_CLOCK_TRIM_BY_PLUS_5 = 5U, /*!< Trim by plus 5   */
	IRC_CLOCK_TRIM_BY_PLUS_6 = 6U, /*!< Trim by plus 6   */
	IRC_CLOCK_TRIM_BY_PLUS_7 = 7U, /*!< Trim by plus 7   */
	IRC_CLOCK_TRIM_BY_PLUS_8 = 8U, /*!< Trim by plus 8   */
	IRC_CLOCK_TRIM_BY_PLUS_9 = 9U, /*!< Trim by plus 9   */
	IRC_CLOCK_TRIM_BY_PLUS_10 = 10U, /*!< Trim by plus 10  */
	IRC_CLOCK_TRIM_BY_PLUS_11 = 11U, /*!< Trim by plus 11  */
	IRC_CLOCK_TRIM_BY_PLUS_12 = 12U, /*!< Trim by plus 12  */
	IRC_CLOCK_TRIM_BY_PLUS_13 = 13U, /*!< Trim by plus 13  */
	IRC_CLOCK_TRIM_BY_PLUS_14 = 14U, /*!< Trim by plus 14  */
	IRC_CLOCK_TRIM_BY_PLUS_15 = 15U, /*!< Trim by plus 15  */

} cs_irc_clk_trim_t;

/*!
 * @brief XOSC bypass type.
 * Implements cs_xosc_bypass_t_Class
 */
typedef enum {
	XOSC_USE_CRYSTAL = 0U, XOSC_USE_EXTAL = 1U,

} cs_xosc_bypass_t;

/*!
 * @brief XOSC mode.
 * Implements cs_xosc_mode_t_Class
 */
typedef enum {
	XOSC_FULL_SWING_PIERCE_MODE = 0U, XOSC_LOOP_CONTROLLED_PIERCE_MODE = 1U,

} cs_xosc_mode_t;

/*!
 * @brief Clock Source XOSC configuration structure.
 * Implements cs_xosc_config_t_Class
 */
typedef struct {
	uint32_t freq; /*!< External oscillator frequency. */
	uint16_t startupDelay; /*!< Startup stabilization time.    */
	cs_xosc_bypass_t bypassOption; /*!< XOSC option                    */
} cs_xosc_config_t;

/*!
 * @brief eTPU clock divider
 * Implements siu_etpu_t_Class
 */
typedef enum {
	SIU_ETPU_DIV_BY_2 = 0U, /*!< Divide by 2 */
	SIU_ETPU_DIV_BY_1 = 1U, /*!< Divide by 1 */
} siu_etpu_t;

/*!
 * @brief SIU non-FM clock peripheral divider
 * Implements siu_perdiv_t_Class
 */
typedef enum {
	SIU_PERDIV_DIV_BY_2 = 0U, /*!< Divide by 2 */
	SIU_PERDIV_DIV_BY_4 = 1U, /*!< Divide by 4 */
	SIU_PERDIV_DIV_BY_8 = 2U, /*!< Divide by 8 */
} siu_perdiv_t;

/*!
 * @brief SIU pbridge clock source
 * Implements siu_fmperdiv_t_Class
 */
typedef enum {
	SIU_PBRIDGE_DIV_BY_2 = 0U, /*!< Divide by 2 */
	SIU_PBRIDGE_DIV_BY_4 = 1U, /*!< Divide by 4 */
	SIU_PBRIDGE_DIV_BY_8 = 2U, /*!< Divide by 8 */
} siu_fmperdiv_t;

/*!
 * @brief SIU LFAST clock select
 * Implements siu_lfastsel_t_Class
 */
typedef enum {
	SIU_LFASTx_XOSC = 0U, /*!< Crystal oscillator (XOSC) */
	SIU_LFASTx_SIPI_REFCLK = 1U, /*!< SIPI_REFCLK               */
	SIU_LFASTx_PLL = 2U, /*!< PLL                       */
} siu_lfastsel_t;

/*!
 * @brief SIU peripheral clock select
 * Implements siu_perclksel_t_Class
 */
typedef enum {
	SIU_PERCLKSEL_SYSCLKDIV = 0U, /*!< Output of the SYSCLKDIV divider */
	SIU_PERCLKSEL_PLL0 = 1U, /*!< Output of PLL0                  */
} siu_perclksel_t;

/*!
 * @brief SIU system clock source select
 * Implements siu_sysclksel_t_Class
 */
typedef enum {
	SIU_SYSCLKSEL_IRCOSC = 0U, /*!< IRCOSC */
	SIU_SYSCLKSEL_XOSC = 1U, /*!< XOSC   */
	SIU_SYSCLKSEL_PLL1 = 2U, /*!< PLL1   */
	SIU_SYSCLKSEL_PLL0 = 3U, /*!< PLL0   */
} siu_sysclksel_t;

/*!
 * @brief SIU system clock source divider
 * Implements siu_sysclkdiv_t_Class
 */
typedef enum {
	SIU_SYSCLK_DIV_1 = 4U, /*!< Divide by 1  */
	SIU_SYSCLK_DIV_2 = 0U, /*!< Divide by 2  */
	SIU_SYSCLK_DIV_4 = 1U, /*!< Divide by 4  */
	SIU_SYSCLK_DIV_8 = 2U, /*!< Divide by 8  */
	SIU_SYSCLK_DIV_16 = 3U, /*!< Divide by 16 */
} siu_sysclkdiv_t;

/*!
 * @brief plldig clock divider
 * Implements cs_plldig_clk_prediv_t_Class
 */
typedef enum {

	PLLDIG_CLOCK_PREDIV_DISABLE = 0U, /*!< Disable predivider        */
	PLLDIG_CLOCK_PREDIV_BY_1 = 1U, /*!< Input clock divided by 1  */
	PLLDIG_CLOCK_PREDIV_BY_2 = 2U, /*!< Input clock divided by 2  */
	PLLDIG_CLOCK_PREDIV_BY_3 = 3U, /*!< Input clock divided by 3  */
	PLLDIG_CLOCK_PREDIV_BY_4 = 4U, /*!< Input clock divided by 4  */
	PLLDIG_CLOCK_PREDIV_BY_5 = 5U, /*!< Input clock divided by 5  */
	PLLDIG_CLOCK_PREDIV_BY_6 = 6U, /*!< Input clock divided by 6  */
	PLLDIG_CLOCK_PREDIV_BY_7 = 7U, /*!< Input clock divided by 7  */

} cs_plldig_clk_prediv_t;

/*!
 * @brief plldig clock configuration
 * Implements cs_plldig_pll_status_t_Class
 */
typedef enum {

	PLLDIG_PLL_OFF = 0U, /*!< Disable PLL        */
	PLLDIG_PLL_ON = 3U /*!< Enable PLL         */
} cs_plldig_pll_status_t;

/*!
 * @brief plldig clockout divider
 * Implements cs_plldig_clkout_div_t_Class
 */
typedef enum {

	PLLDIG_PHI_DIV_BY_1 = 0U, /*!< Divided by 1  */
	PLLDIG_PHI_DIV_BY_2 = 1U, /*!< Divided by 2  */
	PLLDIG_PHI_DIV_BY_3 = 2U, /*!< Divided by 3  */
	PLLDIG_PHI_DIV_BY_4 = 3U, /*!< Divided by 4  */
	PLLDIG_PHI_DIV_BY_5 = 4U, /*!< Divided by 5  */
	PLLDIG_PHI_DIV_BY_6 = 5U, /*!< Divided by 6  */
	PLLDIG_PHI_DIV_BY_7 = 6U, /*!< Divided by 7  */
	PLLDIG_PHI_DIV_BY_8 = 7U, /*!< Divided by 8  */
	PLLDIG_PHI_DIV_BY_9 = 8U, /*!< Divided by 9  */
	PLLDIG_PHI_DIV_BY_10 = 9U, /*!< Divided by 10 */
	PLLDIG_PHI_DIV_BY_11 = 10U, /*!< Divided by 11 */
	PLLDIG_PHI_DIV_BY_12 = 11U, /*!< Divided by 12 */
	PLLDIG_PHI_DIV_BY_13 = 12U, /*!< Divided by 13 */
	PLLDIG_PHI_DIV_BY_14 = 13U, /*!< Divided by 14 */
	PLLDIG_PHI_DIV_BY_15 = 14U, /*!< Divided by 15 */
	PLLDIG_PHI_DIV_BY_16 = 15U, /*!< Divided by 16 */
	PLLDIG_PHI_DIV_BY_17 = 16U, /*!< Divided by 17 */
	PLLDIG_PHI_DIV_BY_18 = 17U, /*!< Divided by 18 */
	PLLDIG_PHI_DIV_BY_19 = 18U, /*!< Divided by 19 */
	PLLDIG_PHI_DIV_BY_20 = 19U, /*!< Divided by 20 */
	PLLDIG_PHI_DIV_BY_21 = 20U, /*!< Divided by 21 */
	PLLDIG_PHI_DIV_BY_22 = 21U, /*!< Divided by 22 */
	PLLDIG_PHI_DIV_BY_23 = 22U, /*!< Divided by 23 */
	PLLDIG_PHI_DIV_BY_24 = 23U, /*!< Divided by 24 */
	PLLDIG_PHI_DIV_BY_25 = 24U, /*!< Divided by 25 */
	PLLDIG_PHI_DIV_BY_26 = 25U, /*!< Divided by 26 */
	PLLDIG_PHI_DIV_BY_27 = 26U, /*!< Divided by 27 */
	PLLDIG_PHI_DIV_BY_28 = 27U, /*!< Divided by 28 */
	PLLDIG_PHI_DIV_BY_29 = 28U, /*!< Divided by 29 */
	PLLDIG_PHI_DIV_BY_30 = 29U, /*!< Divided by 30 */
	PLLDIG_PHI_DIV_BY_31 = 30U, /*!< Divided by 31 */
	PLLDIG_PHI_DIV_BY_32 = 31U, /*!< Divided by 32 */
	PLLDIG_PHI_DIV_BY_33 = 32U, /*!< Divided by 33 */
	PLLDIG_PHI_DIV_BY_34 = 33U, /*!< Divided by 34 */
	PLLDIG_PHI_DIV_BY_35 = 34U, /*!< Divided by 35 */
	PLLDIG_PHI_DIV_BY_36 = 35U, /*!< Divided by 36 */
	PLLDIG_PHI_DIV_BY_37 = 36U, /*!< Divided by 37 */
	PLLDIG_PHI_DIV_BY_38 = 37U, /*!< Divided by 38 */
	PLLDIG_PHI_DIV_BY_39 = 38U, /*!< Divided by 39 */
	PLLDIG_PHI_DIV_BY_40 = 39U, /*!< Divided by 40 */
	PLLDIG_PHI_DIV_BY_41 = 40U, /*!< Divided by 41 */
	PLLDIG_PHI_DIV_BY_42 = 41U, /*!< Divided by 42 */
	PLLDIG_PHI_DIV_BY_43 = 42U, /*!< Divided by 43 */
	PLLDIG_PHI_DIV_BY_44 = 43U, /*!< Divided by 44 */
	PLLDIG_PHI_DIV_BY_45 = 44U, /*!< Divided by 45 */
	PLLDIG_PHI_DIV_BY_46 = 45U, /*!< Divided by 46 */
	PLLDIG_PHI_DIV_BY_47 = 46U, /*!< Divided by 47 */
	PLLDIG_PHI_DIV_BY_48 = 47U, /*!< Divided by 48 */
	PLLDIG_PHI_DIV_BY_49 = 48U, /*!< Divided by 49 */
	PLLDIG_PHI_DIV_BY_50 = 49U, /*!< Divided by 50 */
	PLLDIG_PHI_DIV_BY_51 = 50U, /*!< Divided by 51 */
	PLLDIG_PHI_DIV_BY_52 = 51U, /*!< Divided by 52 */
	PLLDIG_PHI_DIV_BY_53 = 52U, /*!< Divided by 53 */
	PLLDIG_PHI_DIV_BY_54 = 53U, /*!< Divided by 54 */
	PLLDIG_PHI_DIV_BY_55 = 54U, /*!< Divided by 55 */
	PLLDIG_PHI_DIV_BY_56 = 55U, /*!< Divided by 56 */
	PLLDIG_PHI_DIV_BY_57 = 56U, /*!< Divided by 57 */
	PLLDIG_PHI_DIV_BY_58 = 57U, /*!< Divided by 58 */
	PLLDIG_PHI_DIV_BY_59 = 58U, /*!< Divided by 59 */
	PLLDIG_PHI_DIV_BY_60 = 59U, /*!< Divided by 60 */
	PLLDIG_PHI_DIV_BY_61 = 60U, /*!< Divided by 61 */
	PLLDIG_PHI_DIV_BY_62 = 61U, /*!< Divided by 62 */
	PLLDIG_PHI_DIV_BY_63 = 62U, /*!< Divided by 63 */
	PLLDIG_PHI_DIV_BY_64 = 63U, /*!< Divided by 64 */
} cs_plldig_clkout_div_t;

/*!
 * @brief Modulation mode.
 * Implements cs_plldig_mod_type_t_Class
 */
typedef enum {
	CENTRE_SPREAD_MODULATION = 0U, DOWN_SPREAD_MODULATION = 1U,

