newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.h
} cs_plldig_mod_type_t;

/*!
 * @brief CMU IRCOSC low frequency divider.
 * Implements cmu_ircosc_divider_t_Class
 */
typedef enum {
	CMU_LO_FREQ_1 = 0x0,
	CMU_LO_FREQ_2 = 0x1,
	CMU_LO_FREQ_4 = 0x2,
	CMU_LO_FREQ_8 = 0x4,
} cmu_ircosc_divider_t;

/*!
 * @brief Clock Source PLLDIG configuration structure.
 * Implements cs_plldig_config_t_Class
 */
typedef struct {
	bool enable; /*!< PLL enabled/disabled                   */
	cs_plldig_clk_prediv_t predivider; /*!< Input clock predivider. (PREDIV)       */
	bool fracDivider; /*!< Enable fractional divider              */
	uint16_t fracDividerValue; /*!< Fractional divider value               */
	uint8_t mulFactorDiv; /*!< Multiplication factor divider          */
	cs_plldig_clkout_div_t phi0Divider; /*!< Divider for clockout0 - PHI (RFDPHI)   */
	cs_plldig_clkout_div_t phi1Divider; /*!< Divider for clockout1 - PHI1 (RFDPHI1) */
	bool modulation; /*!< Enable/disable modulation              */
	cs_plldig_mod_type_t modulationType; /*!< Modulation type                        */
	uint16_t modulationPeriod; /*!< Stepsize - modulation period           */
	uint16_t incrementStep; /*!< Stepno  - step no                      */
	bool rectangularDitherControl; /*!< Dither control enable */
	uint8_t rectangularDitherControlValue; /*!< Dither control value */
	bool triangularDitherControl; /*!< Dither control enable */
	uint8_t triangularDitherControlValue; /*!< Dither control value */
} cs_plldig_config_t;

/*!
 * @brief Clock Sources configuration structure.
 * Implements cs_config_t_Class
 */
typedef struct {
	cs_xosc_config_t xosc0Config;
	cs_plldig_config_t pll0Config;
	cs_plldig_config_t pll1Config;
	uint32_t sipiRefClkFreq0; /*!< Frequency of the SIPI_REF external clock */
} cs_config_t;

/*!
 * @brief Clock Monitoring Unit configuration structure for CMU_1 - CMU_8 and CMU_PLL0.
 * Implements monitoring_units_config_t_Class
 */
typedef struct {
	bool enable;
	uint32_t lo_freq;
	uint32_t hi_freq;
} monitoring_units_config_t;

/*!
 * @brief Clock Monitoring Units configuration structure.
 * Implements cmu_config_t_Class
 */
typedef struct {
	cmu_ircosc_divider_t cmu_rcdiv;
	monitoring_units_config_t cmu[CMU_MAX_NO];
} cmu_config_t;

/*!
 * @brief Clock configuration structure.
 * Implements clock_manager_user_config_t_Class
 */
typedef struct {
	siu_config_t siuConfig; /*!< SIU configuration.                           */
	cs_config_t clockSourcesConfig; /*!< Clock Sources configuration.                 */
	cmu_config_t cmuConfig; /*!< Clock Monitoring Unit configuration.		 */
} clock_manager_user_config_t;

typedef clock_manager_user_config_t clock_user_config_t;

/*!
 * @brief The clock notification type.
 * Implements clock_manager_notify_t_Class
 */
typedef enum {
	CLOCK_MANAGER_NOTIFY_RECOVER = 0x00U, /*!< Notify IP to recover to previous work state.      */
	CLOCK_MANAGER_NOTIFY_BEFORE = 0x01U, /*!< Notify IP that system will change clock setting.  */
	CLOCK_MANAGER_NOTIFY_AFTER = 0x02U, /*!< Notify IP that have changed to new clock setting. */
} clock_manager_notify_t;

/*!
 * @brief The callback type, indicates what kinds of notification this callback handles.
 * Implements clock_manager_callback_type_t_Class
 */
typedef enum {
	CLOCK_MANAGER_CALLBACK_BEFORE = 0x01U, /*!< Callback handles BEFORE notification.          */
	CLOCK_MANAGER_CALLBACK_AFTER = 0x02U, /*!< Callback handles AFTER notification.           */
	CLOCK_MANAGER_CALLBACK_BEFORE_AFTER = 0x03U /*!< Callback handles BEFORE and AFTER notification */
} clock_manager_callback_type_t;

/*!
 * @brief Clock transition policy.
 * Implements clock_manager_policy_t_Class
 */
typedef enum {
	CLOCK_MANAGER_POLICY_AGREEMENT, /*!< Clock transfers gracefully. */
	CLOCK_MANAGER_POLICY_FORCIBLE /*!< Clock transfers forcefully. */
} clock_manager_policy_t;

/*!
 * @brief Clock notification structure passed to clock callback function.
 * Implements clock_notify_struct_t_Class
 */
typedef struct {
	uint8_t targetClockConfigIndex; /*!< Target clock configuration index. */
	clock_manager_policy_t policy; /*!< Clock transition policy.          */
	clock_manager_notify_t notifyType; /*!< Clock notification type.          */
} clock_notify_struct_t;

/*!
 * @brief Type of clock callback functions.
 */
typedef status_t (*clock_manager_callback_t)(clock_notify_struct_t *notify,
		void* callbackData);

/*!
 * @brief Structure for callback function and its parameter.
 * Implements clock_manager_callback_user_config_t_Class
 */
typedef struct {
	clock_manager_callback_t callback; /*!< Entry of callback function.     */
	clock_manager_callback_type_t callbackType; /*!< Callback type.                  */
	void* callbackData; /*!< Parameter of callback function. */
} clock_manager_callback_user_config_t;

/*!
 * @brief Clock manager state structure.
 * Implements clock_manager_state_t_Class
 */
typedef struct {
	clock_manager_user_config_t const **configTable;/*!< Pointer to clock configure table.*/
	uint8_t clockConfigNum; /*!< Number of clock configurations.  */
	uint8_t curConfigIndex; /*!< Index of current configuration.  */
	clock_manager_callback_user_config_t **callbackConfig; /*!< Pointer to callback table.*/
	uint8_t callbackNum; /*!< Number of clock callbacks.       */
	uint8_t errorCallbackIndex; /*!< Index of callback returns error. */
} clock_manager_state_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus*/

status_t CLOCK_SYS_SetConfiguration(clock_manager_user_config_t const* config);
status_t CLOCK_SYS_GetFreq(clock_names_t clockName, uint32_t *frequency);
status_t CLOCK_SYS_UpdateConfiguration(uint8_t targetConfigIndex,
		clock_manager_policy_t policy);
status_t CLOCK_SYS_Init(clock_manager_user_config_t const **clockConfigsPtr,
		uint8_t configsNumber,
		clock_manager_callback_user_config_t **callbacksPtr,
		uint8_t callbacksNumber);

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* CLOCK_MPC5748G_H */
/*******************************************************************************
 * EOF
 ******************************************************************************/

